<!doctype html>
<html lang="zh"><head><meta charset="utf-8"><meta name="generator" content="Hexo 4.2.0"><meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"><meta><title>软件定义一切 - Hoooo的研究</title><meta description="什么是软件定义？ 软件定义的真正落地，还是在云计算平台里面的应用。2011年前后，OpenFlow被用于云计算平台中进行网络管理，并被广泛接受。在15年的时候，Gartner战略报告首次出现SDN（软件定义），SDN重新“定义”了传统的网络架构甚至通信产业。"><meta property="og:type" content="blog"><meta property="og:title" content="软件定义一切"><meta property="og:url" content="http://www.hoooo.org/2021/02/03/%E8%BD%AF%E4%BB%B6%E5%AE%9A%E4%B9%89%E4%B8%80%E5%88%87/"><meta property="og:site_name" content="Hoooo的研究"><meta property="og:description" content="什么是软件定义？ 软件定义的真正落地，还是在云计算平台里面的应用。2011年前后，OpenFlow被用于云计算平台中进行网络管理，并被广泛接受。在15年的时候，Gartner战略报告首次出现SDN（软件定义），SDN重新“定义”了传统的网络架构甚至通信产业。"><meta property="og:locale" content="zh_CN"><meta property="og:image" content="http://www.hoooo.org/img/og_image.png"><meta property="article:published_time" content="2021-02-03T08:23:05.000Z"><meta property="article:modified_time" content="2021-02-03T08:23:05.000Z"><meta property="article:author" content="Jianan Hu"><meta property="article:tag" content="software"><meta property="twitter:card" content="summary"><meta property="twitter:image" content="/img/og_image.png"><script type="application/ld+json">{"@context":"https://schema.org","@type":"BlogPosting","mainEntityOfPage":{"@type":"WebPage","@id":"https://www.hoooo.org"},"headline":"Hoo的个人笔记","image":["https://www.hoooo.org/img/og_image.png"],"datePublished":"2021-02-03T08:23:05.000Z","dateModified":"2021-02-03T08:23:05.000Z","author":{"@type":"Person","name":"Jianan Hu"},"description":"Hu的个人记录。"}</script><link rel="canonical" href="http://www.hoooo.org/2021/02/03/%E8%BD%AF%E4%BB%B6%E5%AE%9A%E4%B9%89%E4%B8%80%E5%88%87/"><link rel="alternative" href="/atom.xml" title="Hoooo的研究" type="application/atom+xml"><link rel="icon" href="/img/H.svg"><link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.12.0/css/all.css"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/highlight.js@9.12.0/styles/atom-one-light.css"><link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Ubuntu:wght@400;600&amp;family=Source+Code+Pro"><link rel="stylesheet" href="/css/default.css"><style>body>.footer,body>.navbar,body>.section{opacity:0}</style><!--!--><script>var _hmt = _hmt || [];
        (function() {
            var hm = document.createElement("script");
            hm.src = "//hm.baidu.com/hm.js?5fd96c2a5c9055cdab1b643ff129db84";
            var s = document.getElementsByTagName("script")[0];
            s.parentNode.insertBefore(hm, s);
        })();</script><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/lightgallery@1.6.8/dist/css/lightgallery.min.css"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/justifiedGallery@3.7.0/dist/css/justifiedGallery.min.css"><script src="https://www.googletagmanager.com/gtag/js?id=UA-65362962-1" async></script><script>window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
    
        gtag('config', 'UA-65362962-1');</script><script src="https://cdn.jsdelivr.net/npm/pace-js@1.0.2/pace.min.js"></script></head><body class="is-2-column"><nav class="navbar navbar-main"><div class="container"><div class="navbar-brand justify-content-center"><a class="navbar-item navbar-logo" href="/"><img src="/img/H.svg" alt="Hoooo的研究" height="28"></a></div><div class="navbar-menu"><div class="navbar-start"><a class="navbar-item" href="/">Home</a><a class="navbar-item" href="/archives">Archives</a><a class="navbar-item" href="/categories">Categories</a><a class="navbar-item" href="/tags">Tags</a><a class="navbar-item" href="/about">About</a></div><div class="navbar-end"><a class="navbar-item search" title="Suche" href="javascript:;"><i class="fas fa-search"></i></a></div></div></div></nav><section class="section"><div class="container"><div class="columns"><div class="column order-2 column-main is-8-tablet is-8-desktop is-8-widescreen"><div class="card"><article class="card-content article" role="article"><div class="article-meta size-small is-uppercase level is-mobile"><div class="level-left"><time class="level-item" dateTime="2021-02-03T08:23:05.000Z" title="2021-02-03T08:23:05.000Z">2021-02-03</time><span class="level-item"><a class="link-muted" href="/categories/OS/">OS</a></span><span class="level-item">10 分钟 lesen (Über 1548 Worte)</span></div></div><h1 class="title is-3 is-size-4-mobile">软件定义一切</h1><div class="content"><h2 id="&#x4EC0;&#x4E48;&#x662F;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;">&#x4EC0;&#x4E48;&#x662F;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#xFF1F;</h2>
<p>&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x771F;&#x6B63;&#x843D;&#x5730;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x4E91;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x91CC;&#x9762;&#x7684;&#x5E94;&#x7528;&#x3002;2011&#x5E74;&#x524D;&#x540E;&#xFF0C;OpenFlow&#x88AB;&#x7528;&#x4E8E;&#x4E91;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x4E2D;&#x8FDB;&#x884C;&#x7F51;&#x7EDC;&#x7BA1;&#x7406;&#xFF0C;&#x5E76;&#x88AB;&#x5E7F;&#x6CDB;&#x63A5;&#x53D7;&#x3002;&#x5728;15&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;Gartner&#x6218;&#x7565;&#x62A5;&#x544A;&#x9996;&#x6B21;&#x51FA;&#x73B0;SDN&#xFF08;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#xFF09;&#xFF0C;SDN&#x91CD;&#x65B0;&#x201C;&#x5B9A;&#x4E49;&#x201D;&#x4E86;&#x4F20;&#x7EDF;&#x7684;&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x751A;&#x81F3;&#x901A;&#x4FE1;&#x4EA7;&#x4E1A;&#x3002;</p>
<a id="more"></a>
<p><strong>&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7F51;&#x7EDC;</strong>&#x7684;&#x6280;&#x672F;&#x539F;&#x7406;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x7EC4;API&#x5BF9;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x8FDB;&#x884C;&#x4EFB;&#x610F;&#x7684;&#x7F16;&#x7A0B;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x65B0;&#x578B;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3001;&#x62D3;&#x6251;&#x67B6;&#x6784;&#x800C;&#x4E0D;&#x9700;&#x6539;&#x52A8;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x672C;&#x8EAB;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x662F;&#x7BA1;&#x7406;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x3001;&#x63A7;&#x5236;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x3001;&#x6539;&#x5584;&#x4EBA;&#x673A;&#x754C;&#x9762;&#x548C;&#x4E3A;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#x7684;&#x4E00;&#x79CD;&#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;&#xFF0C;&#x5373;&#x5411;&#x4E0A;&#x63D0;&#x4F9B;&#x516C;&#x5171;&#x670D;&#x52A1;&#xFF0C;&#x5411;&#x4E0B;&#x7BA1;&#x7406;&#x8D44;&#x6E90;&#x3002;&#x5982;&#x679C;&#x4ECE;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x89C6;&#x89D2;&#x6765;&#x770B;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x201C;&#x8BA1;&#x7B97;&#x673A;&#x201D;&#xFF0C;&#x4ECE;&#x8F6F;&#x4EF6;&#x7814;&#x7A76;&#x8005;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F53;&#x73B0;&#x4E86;&#x201C;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x201D;&#x4E4B;&#x96C6;&#x5927;&#x6210;&#x3002;</p>
<p><strong>&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x6280;&#x672F;&#x672C;&#x8D28;&#xFF1A;</strong>&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x53EF;&#x7F16;&#x7A0B;&#x3002;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x62BD;&#x8C61;&#x4E3A;&#x865A;&#x62DF;&#x8D44;&#x6E90;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;&#x5BF9;&#x865A;&#x62DF;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x548C;&#x8C03;&#x5EA6;&#x3002;&#x5C31;&#x662F;&#x5728;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x865A;&#x62DF;&#x5316;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x7F16;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6EE1;&#x8DB3;&#x8BBF;&#x95EE;&#x8D44;&#x6E90;&#x7684;&#x591A;&#x6837;&#x6027;&#x7684;&#x9700;&#x6C42;&#x3002;&#x5927;&#x5BB6;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x51FA;&#x73B0;&#x4E86;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5EF6;&#x4F38;&#xFF0C;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x5B58;&#x50A8;&#xFF0C;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7B49;&#x7B49;&#x3002;&#x4F46;&#x6240;&#x6709;&#x67B6;&#x6784;&#x90FD;&#x8DF3;&#x4E0D;&#x51FA;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x7684;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x8FD9;&#x4E9B;SDX&#x5747;&#x7B26;&#x5408;&#x201C;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x865A;&#x62DF;&#x5316;&#x201D;&#x4E0E;&#x201C;&#x7BA1;&#x7406;&#x4EFB;&#x52A1;&#x53EF;&#x7F16;&#x7A0B;&#x201D;&#x7684;&#x6280;&#x672F;&#x539F;&#x7406;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7684;&#x673A;&#x9047;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x4E00;&#x5207;&#x3002;&#x5B9A;&#x4E49;&#x4E00;&#x5207;&#xFF0C;&#x4EBA;-&#x673A;-&#x7269;&#x4E92;&#x8054;&#x662F;&#x6211;&#x4EEC;&#x8FFD;&#x6C42;&#x7684;&#x76EE;&#x6807;&#x3002;&#x6211;&#x4EEC;&#x662F;&#x4E0D;&#x662F;&#x6700;&#x7EC8;&#x80FD;&#x505A;&#x5230;&#x4E07;&#x7269;&#x7686;&#x53EF;&#x4E92;&#x8054;&#xFF0C;&#x4E00;&#x5207;&#x5747;&#x53EF;&#x7F16;&#x7A0B;&#x5462;&#xFF1F;&#x8FD9;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7ED9;&#x672A;&#x6765;&#x4E16;&#x754C;&#x8FBE;&#x6210;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x673A;&#x9047;&#x6240;&#x5728;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x672C;&#x8EAB;&#x8FDB;&#x4E00;&#x6B65;&#x6CDB;&#x5316;&#x548C;&#x5EF6;&#x4F38;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x6211;&#x4EEC;&#x7684;&#x7269;&#x7406;&#x4E16;&#x754C;&#xFF0C;&#x518D;&#x8FDB;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x57CE;&#x5E02;&#x3001;&#x6211;&#x4EEC;&#x7684;&#x884C;&#x4E1A;&#x3001;&#x6211;&#x4EEC;&#x7684;&#x6821;&#x56ED;&#xFF0C;&#x4ECE;&#x5355;&#x4E00;&#x7684;&#x8D44;&#x6E90;&#x7BA1;&#x63A7;&#x5230;&#x4EBA;&#x3001;&#x673A;&#x3001;&#x7269;&#x878D;&#x5408;&#x73AF;&#x5883;&#x4E0B;&#x5BF9;&#x5404;&#x79CD;&#x8D44;&#x6E90;&#x5168;&#x65B9;&#x4F4D;&#x7684;&#x4E92;&#x8054;&#x4E92;&#x901A;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x4ECA;&#x540E;&#x52AA;&#x529B;&#x7684;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x662F;&#x5F53;&#x4ECA;&#x7684;&#x70ED;&#x6F6E;&#xFF0C;&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x89C2;&#x70B9;&#x8FD8;&#x662F;&#x8BA4;&#x4E3A;&#x5904;&#x4E8E;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x7684;&#x7B97;&#x6CD5;&#x667A;&#x80FD;&#x9636;&#x6BB5;&#xFF0C;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x5982;&#x4F55;&#x63D0;&#x4F9B;&#x201C;&#x901A;&#x7528;&#x201D;&#x7684;&#x667A;&#x80FD;&#x5E94;&#x7528;&#x652F;&#x6491;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x6309;&#x9700;&#x6DF1;&#x5EA6;&#x5B9A;&#x5236;&#xFF1F;&#x662F;&#x5426;&#x4F1A;&#x51FA;&#x73B0;&#x9762;&#x5BF9;AI&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF1F;&#x6211;&#x60F3;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E73;&#x53F0;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x5B9E;&#x73B0;&#x3002;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x5728;&#x65B0;&#x4E00;&#x8F6E;&#x9769;&#x547D;&#x6280;&#x672F;&#x4E2D;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x662F;&#x6838;&#x5FC3;&#x7ADE;&#x4E89;&#x529B;&#x4E4B;&#x4E00;&#xFF0C;&#x65B0;&#x4E00;&#x8F6E;&#x5236;&#x9020;&#x9769;&#x547D;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x201C;&#x786C;&#x4EF6;&#x201D;&#x3001;&#x77E5;&#x8BC6;&#x548C;&#x5DE5;&#x827A;&#x6D41;&#x7A0B;&#x7684;&#x8F6F;&#x4EF6;&#x5316;&#xFF0C;&#x8FDB;&#x800C;&#x5B9E;&#x73B0;&#x8F6F;&#x4EF6;&#x7684;&#x5E73;&#x53F0;&#x5316;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x5373;&#x201C;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x201D;&#x3002;</p>
<p>&#x968F;&#x7740;&#x4EBA;&#x3001;&#x673A;&#x3001;&#x7269;&#x7684;&#x878D;&#x5408;&#xFF0C;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x6311;&#x6218;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x8FD9;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#xFF0C;&#x7CFB;&#x7EDF;&#x8D28;&#x91CF;&#xFF0C;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#xFF0C;&#x66F4;&#x8F7B;&#x91CF;&#x7684;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x4ECE;&#x539F;&#x6709;&#x7CFB;&#x7EDF;&#x5230;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7CFB;&#x7EDF;&#x5E73;&#x6ED1;&#x8FC7;&#x6E21;&#xFF0C;&#x9AD8;&#x5EA6;&#x81EA;&#x9002;&#x5E94;&#x667A;&#x80FD;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x3002;</p>
<ul>
<li><p>&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#xFF0C;&#x5305;&#x62EC;&#x6BD4;&#x5982;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x53D7;&#x7BA1;&#x5143;&#x7D20;&#x7684;&#x5408;&#x7406;&#x201C;&#x7C92;&#x5EA6;&#x201D;&#x548C;&#x201C;&#x5C42;&#x6B21;&#x201D;&#xFF1F;&#x5982;&#x4F55;&#x754C;&#x5B9A;&#x8F6F;&#x3001;&#x786C;&#x4EF6;&#x7684;&#x529F;&#x80FD;&#x5212;&#x5206;&#x5E76;&#x7EC4;&#x88C5;&#x3001;&#x914D;&#x7F6E;&#x76F8;&#x5E94;&#x5143;&#x7D20;&#xFF1F;&#x7B49;&#x3002;</p></li>
<li><p>&#x7CFB;&#x7EDF;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x6709;&#x5982;&#x4F55;&#x5408;&#x7406;&#x5E73;&#x8861;&#x7BA1;&#x7406;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x201C;&#x865A;&#x62DF;&#x5316;&#x201D;&#x540E;&#x7684;&#x6027;&#x80FD;&#x635F;&#x8017;&#xFF08;&#x4E0E;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x539F;&#x7CFB;&#x7EDF;&#x76F8;&#x6BD4;&#xFF09;&#xFF1F;&#x5982;&#x4F55;&#x964D;&#x4F4E;&#x201C;&#x8F6F;&#x4EF6;&#x5B9E;&#x73B0;&#x201D;&#x7684;&#x590D;&#x6742;&#x6027;&#x548C;&#x6545;&#x969C;&#x7387;&#xFF0C;&#x6709;&#x6548;&#x5B9A;&#x4F4D;&#x6545;&#x969C;&#x4EE5;&#x4FDD;&#x969C;&#x53EF;&#x9760;&#x6027;&#xFF1F;&#x7B49;&#x7B49;&#x3002;</p></li>
<li><p>&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#xFF0C;&#x5BF9;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x53EF;&#x7F16;&#x7A0B;&#x5E26;&#x6765;&#x5F00;&#x653E;&#x6027;&#x3001;&#x7075;&#x6D3B;&#x6027;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x7684;&#x5B89;&#x5168;&#x9690;&#x60A3;&#x3002;&#x5BF9;&#x4E8E;&#x5DE5;&#x4E1A;&#x63A7;&#x5236;&#x7B49;&#x5B89;&#x5168;&#x6538;&#x5173;&#x9886;&#x57DF;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x96BE;&#x4EE5;&#x96BE;&#x4EE5;&#x4F30;&#x91CF;&#x7684;&#x635F;&#x5931;&#x3002;</p></li>
<li><p>&#x66F4;&#x8F7B;&#x91CF;&#x7684;&#x865A;&#x62DF;&#x5316;&#x3002;&#x5927;&#x91CF;&#x7684;&#x65B0;&#x8BBE;&#x5907;&#x4EA7;&#x751F;&#xFF0C;&#x865A;&#x62DF;&#x5316;&#x5B9E;&#x73B0;&#x4E86;&#x5BF9;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x7684;&#x8F6F;&#x5316;&#xFF0C;&#x662F;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x57FA;&#x7840;&#x6280;&#x672F;&#xFF0C;&#x73B0;&#x6709;&#x4EE5;&#x865A;&#x62DF;&#x673A;&#x4E3A;&#x5355;&#x4F4D;&#x7684;&#x6280;&#x672F;&#x8FC7;&#x4E8E;&#x91CD;&#x8F7D;&#xFF0C;&#x96BE;&#x4EE5;&#x6EE1;&#x8DB3;&#x6027;&#x80FD;&#x548C;&#x5B9E;&#x65F6;&#x6027;&#x8981;&#x6C42;&#x3002;</p></li>
<li><p>&#x539F;&#x6709;&#x7CFB;&#x7EDF;&#x5230;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7CFB;&#x7EDF;&#x5E73;&#x6ED1;&#x8FC7;&#x6E21;&#x3002;&#x5982;&#x4F55;&#x5C06;&#x539F;&#x6709;&#x7CFB;&#x7EDF;&#x5E73;&#x6ED1;&#x8FC7;&#x6E21;&#x5230;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7CFB;&#x7EDF;&#xFF1F;&#x901A;&#x8FC7;&#x5BF9;&#x5DF2;&#x6709;&#x7684;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x5927;&#x5E45;&#x5EA6;&#x7684;&#x6539;&#x9020;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x65B0;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x9700;&#x8981;&#x505A;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x9762;&#x4E34;&#x7684;&#x4EBA;&#x529B;&#xFF0C;&#x65F6;&#x95F4;&#xFF0C;&#x7ECF;&#x6D4E;&#xFF0C;&#x98CE;&#x63A7;&#x7B49;&#x56E0;&#x7D20;&#x3002;&#x8FD9;&#x4E2A;&#x5E73;&#x6ED1;&#x8FC7;&#x6E21;&#x4E5F;&#x9700;&#x8981;&#x5408;&#x7406;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x5426;&#x5219;&#x5F88;&#x96BE;&#x505A;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p></li>
<li><p>&#x9AD8;&#x5EA6;&#x81EA;&#x9002;&#x5E94;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x3002;&#x4ECE;&#x8F6F;&#x4EF6;&#x4EBA;&#x8FFD;&#x6C42;&#x7684;&#x76EE;&#x6807;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8FFD;&#x6C42;&#x4E00;&#x79CD;&#x66F4;&#x4E3A;&#x9AD8;&#x5EA6;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x667A;&#x80FD;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x3002;&#x73B0;&#x5728;&#x5E73;&#x53F0;&#x65B9;&#x5F0F;&#x662F;&#x4EE5;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5C42;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x5C31;&#x8981;&#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF0C;&#x6539;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x5E94;&#x7528;&#x4E5F;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x3002;&#x6211;&#x4EEC;&#x8FFD;&#x6C42;&#x7684;&#x7406;&#x60F3;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x8F6F;&#x4EF6;&#x5E73;&#x53F0;&#x5177;&#x6709;&#x9884;&#x6D4B;&#x548C;&#x7BA1;&#x7406;&#x672A;&#x6765;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x53D8;&#x5316;&#x7684;&#x80FD;&#x529B;&#x3002;</p></li>
</ul>
<blockquote>
<p>&#x6765;&#x6E90;&#xFF1A;<a href="https://www.leiphone.com/news/201710/njWSLnuUcu8EvU8Q.html">&#x6885;&#x5B8F;&#x9662;&#x58EB;&#xFF1A;&#x8F6F;&#x4EF6;&#x5B9A;&#x4E49;&#x7684;&#x672A;&#x6765;&#x2014;&#x2014;&#x4E07;&#x7269;&#x7686;&#x53EF;&#x4E92;&#x8054;&#xFF0C;&#x4E00;&#x5207;&#x5747;&#x53EF;&#x7F16;&#x7A0B; | CNCC 2017</a></p>
</blockquote>
</div><div class="article-tags size-small mb-4"><span class="mr-2">#</span><a class="link-muted mr-2" rel="tag" href="/tags/software/">software</a></div><div class="sharethis-inline-share-buttons"></div><script src="https://platform-api.sharethis.com/js/sharethis.js#property=5ed77c944764050012743e2b&amp;product=inline-share-buttons" defer></script></article></div><!--!--><nav class="post-navigation mt-4 level is-mobile"><div class="level-start"><a class="article-nav-prev level level-item link-muted" href="/2021/02/17/elf/"><i class="level-item fas fa-chevron-left"></i><span class="level-item">【译】Linux系统中的 ELF 文件的理解与分析</span></a></div><div class="level-end"><a class="article-nav-next level level-item link-muted" href="/2021/01/30/python-tricks/"><span class="level-item">python tricks</span><i class="level-item fas fa-chevron-right"></i></a></div></nav><div class="card"><div class="card-content"><h3 class="title is-5">Kommentare</h3><div id="disqus_thread"><noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript></div><script>var disqus_config = function () {
            this.page.url = 'http://www.hoooo.org/2021/02/03/%E8%BD%AF%E4%BB%B6%E5%AE%9A%E4%B9%89%E4%B8%80%E5%88%87/';
            this.page.identifier = '2021/02/03/软件定义一切/';
        };
        (function() {
            var d = document, s = d.createElement('script');  
            s.src = '//' + 'hoo' + '.disqus.com/embed.js';
            s.setAttribute('data-timestamp', +new Date());
            (d.head || d.body).appendChild(s);
        })();</script></div></div></div><div class="column column-left is-4-tablet is-4-desktop is-4-widescreen  order-1"><div class="card widget"><div class="card-content"><nav class="level"><div class="level-item has-text-centered flex-shrink-1"><div><figure class="image is-128x128 mx-auto mb-2"><img class="avatar is-rounded" src="https://cdn.jsdelivr.net/gh/bxtx999/Image-Hosting/img/20200603184421.jpg" alt="Hoooo"></figure><p class="title is-size-4 is-block line-height-inherit">Hoooo</p><p class="is-size-6 is-block">Student</p><p class="is-size-6 is-flex justify-content-center"><i class="fas fa-map-marker-alt mr-1"></i><span>China</span></p></div></div></nav><nav class="level is-mobile"><div class="level-item has-text-centered is-marginless"><div><p class="heading">Posts</p><a href="/archives"><p class="title">29</p></a></div></div><div class="level-item has-text-centered is-marginless"><div><p class="heading">Kategorien</p><a href="/categories"><p class="title">13</p></a></div></div><div class="level-item has-text-centered is-marginless"><div><p class="heading">Tags</p><a href="/tags"><p class="title">33</p></a></div></div></nav><div class="level"><a class="level-item button is-primary is-rounded" href="https://github.com/bxtx999" target="_blank" rel="noopener">Folgen</a></div><div class="level is-mobile"><a class="level-item button is-transparent is-marginless" target="_blank" rel="noopener" title="Github" href="https://github.com/bxtx999"><i class="fab fa-github"></i></a><a class="level-item button is-transparent is-marginless" target="_blank" rel="noopener" title="RSS" href="/"><i class="fas fa-rss"></i></a></div></div></div><!--!--><div class="card widget"><div class="card-content"><div class="menu"><h3 class="menu-label">Kategorien</h3><ul class="menu-list"><li><a class="level is-mobile is-marginless" href="/categories/Javascript/"><span class="level-start"><span class="level-item">Javascript</span></span><span class="level-end"><span class="level-item tag">1</span></span></a><ul class="mr-0"><li><a class="level is-mobile is-marginless" href="/categories/Javascript/WebGPU/"><span class="level-start"><span class="level-item">WebGPU</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li></ul></li><li><a class="level is-mobile is-marginless" href="/categories/OS/"><span class="level-start"><span class="level-item">OS</span></span><span class="level-end"><span class="level-item tag">5</span></span></a><ul class="mr-0"><li><a class="level is-mobile is-marginless" href="/categories/OS/Linux/"><span class="level-start"><span class="level-item">Linux</span></span><span class="level-end"><span class="level-item tag">3</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/OS/%E8%AE%A1%E7%AE%97%E6%9C%BA%E6%80%A7%E8%83%BD/"><span class="level-start"><span class="level-item">计算机性能</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li></ul></li><li><a class="level is-mobile is-marginless" href="/categories/Python/"><span class="level-start"><span class="level-item">Python</span></span><span class="level-end"><span class="level-item tag">4</span></span></a><ul class="mr-0"><li><a class="level is-mobile is-marginless" href="/categories/Python/functools/"><span class="level-start"><span class="level-item">functools</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li></ul></li><li><a class="level is-mobile is-marginless" href="/categories/%E5%9B%BE%E8%B1%A1%E5%A4%84%E7%90%86/"><span class="level-start"><span class="level-item">图象处理</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E7%94%9F%E6%B4%BB/"><span class="level-start"><span class="level-item">生活</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E7%A4%BE%E4%BC%9A%E8%AE%A1%E7%AE%97/"><span class="level-start"><span class="level-item">社会计算</span></span><span class="level-end"><span class="level-item tag">6</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E7%AE%97%E6%B3%95/"><span class="level-start"><span class="level-item">算法</span></span><span class="level-end"><span class="level-item tag">6</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E7%BC%96%E7%A8%8B/"><span class="level-start"><span class="level-item">编程</span></span><span class="level-end"><span class="level-item tag">3</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E8%BF%90%E7%AD%B9%E5%AD%A6/"><span class="level-start"><span class="level-item">运筹学</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li></ul></div></div></div><div class="card widget"><div class="card-content"><div class="menu"><h3 class="menu-label">Archive</h3><ul class="menu-list"><li><a class="level is-mobile is-marginless" href="/archives/2021/02/"><span class="level-start"><span class="level-item">二月 2021</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2021/01/"><span class="level-start"><span class="level-item">一月 2021</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/12/"><span class="level-start"><span class="level-item">十二月 2020</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/10/"><span class="level-start"><span class="level-item">十月 2020</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/09/"><span class="level-start"><span class="level-item">九月 2020</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/08/"><span class="level-start"><span class="level-item">八月 2020</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/06/"><span class="level-start"><span class="level-item">六月 2020</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/05/"><span class="level-start"><span class="level-item">五月 2020</span></span><span class="level-end"><span class="level-item tag">5</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/04/"><span class="level-start"><span class="level-item">四月 2020</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/03/"><span class="level-start"><span class="level-item">三月 2020</span></span><span class="level-end"><span class="level-item tag">4</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2018/07/"><span class="level-start"><span class="level-item">七月 2018</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2018/06/"><span class="level-start"><span class="level-item">六月 2018</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2018/04/"><span class="level-start"><span class="level-item">四月 2018</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2017/12/"><span class="level-start"><span class="level-item">十二月 2017</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2017/01/"><span class="level-start"><span class="level-item">一月 2017</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2016/11/"><span class="level-start"><span class="level-item">十一月 2016</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2016/04/"><span class="level-start"><span class="level-item">四月 2016</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li></ul></div></div></div><div class="card widget"><div class="card-content"><div class="menu"><h3 class="menu-label">Tags</h3><div class="field is-grouped is-grouped-multiline"><div class="control"><a class="tags has-addons" href="/tags/DSL/"><span class="tag">DSL</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/GPU/"><span class="tag">GPU</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/Huge-Page/"><span class="tag">Huge Page</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/Pin/"><span class="tag">Pin</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/Python/"><span class="tag">Python</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/SystemTap/"><span class="tag">SystemTap</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/algorithms/"><span class="tag">algorithms</span><span class="tag is-grey-lightest">3</span></a></div><div class="control"><a class="tags has-addons" href="/tags/data-structure/"><span class="tag">data structure</span><span class="tag is-grey-lightest">3</span></a></div><div class="control"><a class="tags has-addons" href="/tags/elf/"><span class="tag">elf</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/functools/"><span class="tag">functools</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/image-processing/"><span class="tag">image processing</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/javascript/"><span class="tag">javascript</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/lru/"><span class="tag">lru</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/pip/"><span class="tag">pip</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/pypi/"><span class="tag">pypi</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/python/"><span class="tag">python</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/software/"><span class="tag">software</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/tricks/"><span class="tag">tricks</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%86%B3%E7%AD%96%E8%AE%BA/"><span class="tag">决策论</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%8D%9A%E5%BC%88%E8%AE%BA/"><span class="tag">博弈论</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%9B%BE/"><span class="tag">图</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%9B%BE%E5%83%8F%E5%A4%84%E7%90%86/"><span class="tag">图像处理</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%B0%8F%E4%B8%96%E7%95%8C%E9%97%AE%E9%A2%98/"><span class="tag">小世界问题</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E6%9C%89%E5%90%91%E5%9B%BE/"><span class="tag">有向图</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E6%B5%81%E8%A1%8C%E6%AD%8C%E6%9B%B2/"><span class="tag">流行歌曲</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E6%BC%94%E5%94%B1/"><span class="tag">演唱</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%A4%BE%E4%BC%9A%E8%AE%A1%E7%AE%97/"><span class="tag">社会计算</span><span class="tag is-grey-lightest">6</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%AE%97%E6%B3%95/"><span class="tag">算法</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%AE%97%E6%B3%95%E4%B8%8E%E6%95%B0%E6%8D%AE%E7%BB%93%E6%9E%84/"><span class="tag">算法与数据结构</span><span class="tag is-grey-lightest">3</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%BC%96%E7%A8%8B%E8%8C%83%E5%BC%8F/"><span class="tag">编程范式</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%BD%91%E9%A1%B5%E6%8E%92%E5%BA%8F/"><span class="tag">网页排序</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E8%AE%A1%E7%AE%97%E6%80%9D%E7%BB%B4/"><span class="tag">计算思维</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E8%BF%90%E7%AD%B9%E5%AD%A6/"><span class="tag">运筹学</span><span class="tag is-grey-lightest">1</span></a></div></div></div></div></div><div class="card widget"><div class="card-content"><div class="menu"><h3 class="menu-label">Subscribe to Updates</h3><form action="https://feedburner.google.com/fb/a/mailverify" method="post" target="popupwindow" onsubmit="window.open(&#039;https://feedburner.google.com/fb/a/mailverify?uri=15ovpvd8su4sb5j9um1lhtb2j4&#039;,&#039;popupwindow&#039;,&#039;scrollbars=yes,width=550,height=520&#039;);return true"><input type="hidden" value="15ovpvd8su4sb5j9um1lhtb2j4" name="uri"><input type="hidden" name="loc" value="en_US"><div class="field has-addons"><div class="control has-icons-left is-expanded"><input class="input" name="email" type="email" placeholder="Email"><span class="icon is-small is-left"><i class="fas fa-envelope"></i></span></div><div class="control"><input class="button is-primary" type="submit" value="Subscribe"></div></div></form></div></div></div></div><!--!--></div></div></section><footer class="footer"><div class="container"><div class="level"><div class="level-start"><a class="footer-logo is-block mb-2" href="/"><img src="/img/H.svg" alt="Hoooo的研究" height="28"></a><p class="size-small"><span>&copy; 2021 Jianan Hu</span>  Powered by <a href="https://hexo.io/" target="_blank" rel="noopener">Hexo</a> &amp; <a href="https://github.com/ppoffice/hexo-theme-icarus" target="_blank" rel="noopener">Icarus</a></p></div><div class="level-end"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/jquery@3.3.1/dist/jquery.min.js"></script><script src="https://cdn.jsdelivr.net/npm/moment@2.22.2/min/moment-with-locales.min.js"></script><script>moment.locale("zh-cn");</script><script>var IcarusThemeSettings = {
            site: {
                url: 'http://www.hoooo.org',
                external_link: {"enable":true,"exclude":[]}
            },
            article: {
                highlight: {
                    clipboard: true,
                    fold: 'unfolded'
                }
            }
        };</script><script src="https://cdn.jsdelivr.net/npm/clipboard@2.0.4/dist/clipboard.min.js" defer></script><script src="/js/animation.js"></script><a id="back-to-top" title="Zurück nach oben" href="javascript:;"><i class="fas fa-chevron-up"></i></a><script src="/js/back_to_top.js" defer></script><!--!--><script src="https://cdn.jsdelivr.net/npm/lightgallery@1.6.8/dist/js/lightgallery.min.js" defer></script><script src="https://cdn.jsdelivr.net/npm/justifiedGallery@3.7.0/dist/js/jquery.justifiedGallery.min.js" defer></script><script>window.addEventListener("load", () => {
            if (typeof $.fn.lightGallery === 'function') {
                $('.article').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof $.fn.justifiedGallery === 'function') {
                if ($('.justified-gallery > p > .gallery-item').length) {
                    $('.justified-gallery > p > .gallery-item').unwrap();
                }
                $('.justified-gallery').justifiedGallery();
            }
        });</script><!--!--><!--!--><script src="/js/main.js" defer></script><div class="searchbox"><div class="searchbox-container"><div class="searchbox-header"><div class="searchbox-input-container"><input class="searchbox-input" type="text" placeholder="Tippen Sie etwas..."></div><a class="searchbox-close" href="javascript:;">×</a></div><div class="searchbox-body"></div></div></div><script src="/js/insight.js" defer></script><script>document.addEventListener('DOMContentLoaded', function () {
            loadInsight({"contentUrl":"/content.json"}, {"hint":"Tippen Sie etwas...","untitled":"(Untitled)","posts":"Posts","pages":"Pages","categories":"Kategorien","tags":"Tags"});
        });</script></body></html>