<!doctype html>
<html lang="zh"><head><meta charset="utf-8"><meta name="generator" content="Hexo 4.2.0"><meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"><meta><title>冒号课堂笔记(1-4课) - Hoooo的研究</title><meta description="《冒泡课堂：编程范式与OOP思想》读书笔记 1-4 课 编程范式  范式译自英文的paradigm，也有译作典范、范型、范例的。所谓编程范式（programming paradigm），指的是计算机编程的基本风格或典范模式。借用哲学术语，如果说每个编程者都在创造虚拟世界，那么编程范式就是他们置身其中自觉不自觉采用德尔世界观与方法论。"><meta property="og:type" content="blog"><meta property="og:title" content="冒号课堂笔记(1-4课)"><meta property="og:url" content="http://www.hoooo.org/2020/05/17/%E5%86%92%E5%8F%B7%E8%AF%BE%E5%A0%82%E7%AC%94%E8%AE%B0-1-4/"><meta property="og:site_name" content="Hoooo的研究"><meta property="og:description" content="《冒泡课堂：编程范式与OOP思想》读书笔记 1-4 课 编程范式  范式译自英文的paradigm，也有译作典范、范型、范例的。所谓编程范式（programming paradigm），指的是计算机编程的基本风格或典范模式。借用哲学术语，如果说每个编程者都在创造虚拟世界，那么编程范式就是他们置身其中自觉不自觉采用德尔世界观与方法论。"><meta property="og:image" content="http://www.hoooo.org/img/og_image.png"><meta property="article:published_time" content="2020-05-17T08:16:44.000Z"><meta property="article:modified_time" content="2020-05-17T08:16:44.000Z"><meta property="article:author" content="Jianan Hu"><meta property="article:tag" content="编程范式"><meta property="twitter:card" content="summary"><meta property="twitter:image" content="/img/og_image.png"><script type="application/ld+json">{"@context":"https://schema.org","@type":"BlogPosting","mainEntityOfPage":{"@type":"WebPage","@id":"http://www.hoooo.org/2020/05/17/%E5%86%92%E5%8F%B7%E8%AF%BE%E5%A0%82%E7%AC%94%E8%AE%B0-1-4/"},"headline":"Hoooo的研究","image":["http://www.hoooo.org/img/og_image.png"],"datePublished":"2020-05-17T08:16:44.000Z","dateModified":"2020-05-17T08:16:44.000Z","author":{"@type":"Person","name":"Jianan Hu"},"description":"《冒泡课堂：编程范式与OOP思想》读书笔记 1-4 课\r 编程范式\r \r 范式译自英文的paradigm，也有译作典范、范型、范例的。所谓编程范式（programming paradigm），指的是计算机编程的基本风格或典范模式。借用哲学术语，如果说每个编程者都在创造虚拟世界，那么编程范式就是他们置身其中自觉不自觉采用德尔世界观与方法论。"}</script><link rel="canonical" href="http://www.hoooo.org/2020/05/17/%E5%86%92%E5%8F%B7%E8%AF%BE%E5%A0%82%E7%AC%94%E8%AE%B0-1-4/"><link rel="alternative" href="/atom.xml" title="Hoooo的研究" type="application/atom+xml"><link rel="icon" href="/img/favicon.png"><link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.12.0/css/all.css"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/highlight.js@9.12.0/styles/atom-one-light.css"><link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Ubuntu:wght@400;600&amp;family=Source+Code+Pro"><link rel="stylesheet" href="/css/default.css"><!--!--><script>var _hmt = _hmt || [];
        (function() {
            var hm = document.createElement("script");
            hm.src = "//hm.baidu.com/hm.js?5fd96c2a5c9055cdab1b643ff129db84";
            var s = document.getElementsByTagName("script")[0];
            s.parentNode.insertBefore(hm, s);
        })();</script><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/lightgallery@1.6.8/dist/css/lightgallery.min.css"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/justifiedGallery@3.7.0/dist/css/justifiedGallery.min.css"><script src="https://www.googletagmanager.com/gtag/js?id=UA-65362962-1" async></script><script>window.dataLayer = window.dataLayer || [];
        function gtag(){dataLayer.push(arguments);}
        gtag('js', new Date());
    
        gtag('config', 'UA-65362962-1');</script><script src="https://cdn.jsdelivr.net/npm/pace-js@1.0.2/pace.min.js"></script></head><body class="is-2-column"><nav class="navbar navbar-main"><div class="container"><div class="navbar-brand justify-content-center"><a class="navbar-item navbar-logo" href="/"><img src="/img/favicon.png" alt="Hoooo的研究" height="28"></a></div><div class="navbar-menu"><div class="navbar-start"><a class="navbar-item" href="/">Home</a><a class="navbar-item" href="/archives">Archives</a><a class="navbar-item" href="/categories">Categories</a><a class="navbar-item" href="/tags">Tags</a><a class="navbar-item" href="/about">About</a></div><div class="navbar-end"><a class="navbar-item search" title="Buscar" href="javascript:;"><i class="fas fa-search"></i></a></div></div></div></nav><section class="section"><div class="container"><div class="columns"><div class="column order-2 column-main is-8-tablet is-8-desktop is-8-widescreen"><div class="card"><article class="card-content article" role="article"><div class="article-meta size-small is-uppercase level is-mobile"><div class="level-left"><time class="level-item" dateTime="2020-05-17T08:16:44.000Z" title="2020-05-17T08:16:44.000Z">2020-05-17</time><span class="level-item"><a class="link-muted" href="/categories/%E7%BC%96%E7%A8%8B/">编程</a></span><span class="level-item">30 minutes leer (Acerca de 4452 palabras)</span></div></div><h1 class="title is-3 is-size-4-mobile">冒号课堂笔记(1-4课)</h1><div class="content"><h3 id="&#x5192;&#x6CE1;&#x8BFE;&#x5802;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#x4E0E;oop&#x601D;&#x60F3;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0;-1-4-&#x8BFE;">&#x300A;&#x5192;&#x6CE1;&#x8BFE;&#x5802;&#xFF1A;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#x4E0E;OOP&#x601D;&#x60F3;&#x300B;&#x8BFB;&#x4E66;&#x7B14;&#x8BB0; 1-4 &#x8BFE;</h3>
<h5 id="&#x7F16;&#x7A0B;&#x8303;&#x5F0F;">&#x7F16;&#x7A0B;&#x8303;&#x5F0F;</h5>
<ol type="1">
<li>&#x8303;&#x5F0F;&#x8BD1;&#x81EA;&#x82F1;&#x6587;&#x7684;paradigm&#xFF0C;&#x4E5F;&#x6709;&#x8BD1;&#x4F5C;&#x5178;&#x8303;&#x3001;&#x8303;&#x578B;&#x3001;&#x8303;&#x4F8B;&#x7684;&#x3002;&#x6240;&#x8C13;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#xFF08;programming paradigm&#xFF09;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x7F16;&#x7A0B;&#x7684;&#x57FA;&#x672C;&#x98CE;&#x683C;&#x6216;&#x5178;&#x8303;&#x6A21;&#x5F0F;&#x3002;&#x501F;&#x7528;&#x54F2;&#x5B66;&#x672F;&#x8BED;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x6BCF;&#x4E2A;&#x7F16;&#x7A0B;&#x8005;&#x90FD;&#x5728;&#x521B;&#x9020;&#x865A;&#x62DF;&#x4E16;&#x754C;&#xFF0C;&#x90A3;&#x4E48;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x7F6E;&#x8EAB;&#x5176;&#x4E2D;&#x81EA;&#x89C9;&#x4E0D;&#x81EA;&#x89C9;&#x91C7;&#x7528;&#x5FB7;&#x5C14;&#x4E16;&#x754C;&#x89C2;&#x4E0E;&#x65B9;&#x6CD5;&#x8BBA;&#x3002;</li>
</ol>
<a id="more"></a>
<ol start="2" type="1">
<li><p>&#x5E93;&#xFF08;lib&#xFF09;&#x4E0E;&#x6846;&#x67B6;&#xFF08;framework&#xFF09;</p>
<ul>
<li><p>&#x4E3A;&#x4FDD;&#x8BC1;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5FEB;&#x901F;&#x6709;&#x6548;&#xFF0C;&#x901A;&#x5E38;&#x91C7;&#x53D6;&#xFF1A;</p>
<p>&#x5728;&#x5B8F;&#x89C2;&#x7BA1;&#x7406;&#x4E0A;&#x9009;&#x53D6;&#x6846;&#x67B6;&#x4EE5;&#x63A7;&#x5236;&#x6574;&#x4F53;&#x7684;&#x7ED3;&#x6784;&#x4E0E;&#x6D41;&#x7A0B;&#xFF1B;&#x5728;&#x5FAE;&#x89C2;&#x5B9E;&#x73B0;&#x4E0A;&#x5229;&#x7528;&#x5E93;&#x548C;&#x5DE5;&#x5177;&#x5305;&#x6765;&#x89E3;&#x51B3;&#x7EC6;&#x8282;&#x95EE;&#x9898;&#x3002;</p></li>
<li><p>&#x6846;&#x67B6;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#x4F7F;&#x8BBE;&#x8BA1;&#x8005;&#x5728;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x7684;&#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#x4E0A;&#x4E0D;&#x5FC5;&#x91CD;&#x65B0;&#x53D1;&#x660E;&#x8F6E;&#x5B50;&#xFF1B;&#x5E93;&#x548C;&#x5DE5;&#x5177;&#x5305;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#x4F7F;&#x5F00;&#x53D1;&#x8005;&#x6446;&#x8131;&#x5E95;&#x5C42;&#x7F16;&#x7801;&#xFF0C;&#x4E13;&#x6CE8;&#x4E8E;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x548C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3002;</p></li>
<li><p>&#x5E93;&#x548C;&#x5DE5;&#x5177;&#x5305;&#x662F;&#x4E3A;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x5E26;&#x6765;&#x81EA;&#x7531;&#x7684;&#xFF0C;&#x6846;&#x67B6;&#x662F;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x5E26;&#x6765;&#x7EA6;&#x675F;&#x7684;&#x3002;</p></li>
<li><p>&#x5E93;&#x548C;&#x5DE5;&#x5177;&#x5305;&#x4FA7;&#x91CD;&#x4EE3;&#x7801;&#x91CD;&#x7528;&#xFF0C;&#x6846;&#x67B6;&#x4FA7;&#x91CD;&#x8BBE;&#x8BA1;&#x91CD;&#x7528;&#x3002;</p></li>
<li><p>&#x6846;&#x67B6;&#x662F;&#x901A;&#x8FC7;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#xFF08;IoC&#xFF09;&#x673A;&#x5236;&#x63A7;&#x5236;&#x5168;&#x5C40;&#xFF0C;&#x800C;&#x5E93;&#x548C;&#x5DE5;&#x5177;&#x5305;&#x7528;callback&#x77E5;&#x8BC6;&#x5C40;&#x90E8;&#x7684;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x727A;&#x7272;&#x4E86;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6D41;&#x7A0B;&#x7684;&#x4E3B;&#x5BFC;&#x6743;&#xFF0C;&#x6362;&#x6765;&#x7684;&#x662F;&#x66F4;&#x7B80;&#x6D01;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x66F4;&#x9AD8;&#x7684;&#x751F;&#x4EA7;&#x6548;&#x7387;&#x3002;</p></li>
</ul></li>
<li><p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x8F6F;&#x4EF6;&#x7684;&#x6218;&#x672F;&#x601D;&#x60F3;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x8F6F;&#x4EF6;&#x7684;&#x6218;&#x7565;&#x51B3;&#x7B56;&#x3002;&#x4E0E;&#x6846;&#x67B6;&#x3001;&#x5E93;&#x548C;&#x5DE5;&#x5177;&#x5305;&#x4E0D;&#x540C;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x662F;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#xFF0C;&#x662F;&#x8F6F;&#x4EF6;&#x601D;&#x60F3;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0E;&#x60EF;&#x7528;&#x6CD5;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x5E38;&#x53D1;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x524D;&#x8005;&#x91CD;&#x8BBE;&#x8BA1;&#xFF0C;&#x540E;&#x8005;&#x504F;&#x5B9E;&#x73B0;&#x3002;</p></li>
<li><p>&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#xFF08;Inversion of Control&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x4E0E;&#x671D;&#x54EA;&#x4E2A;&#x7528;&#x7684;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x8C03;&#x7528;&#x53EF;&#x91CD;&#x7528;&#x5E93;&#xFF08;library&#xFF09;&#x4EE3;&#x7801;&#x4E0D;&#x540C;&#xFF0C;IoC&#x5012;&#x8F6C;&#x63A7;&#x5236;&#x6D41;&#x65B9;&#x5411;&#xFF1A;&#x7531;&#x5E93;&#x4EE3;&#x7801;&#x8C03;&#x7528;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x3002;&#x6709;&#x4EBA;&#x5C06;&#x6B64;&#x6BD4;&#x4F5C;&#x597D;&#x83B1;&#x575E;&#x539F;&#x5219;&#xFF1A;&#x201D;&#x4E0D;&#x8981;&#x6253;&#x7535;&#x8BDD;&#x7ED9;&#x6211;&#x4EEC;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x6253;&#x7ED9;&#x4F60;&#x7684;&#x201D;&#x3002;</p></li>
<li><p>&#x547D;&#x4EE4;&#x5F0F;&#x7F16;&#x7A0B;&#x65F6;&#x51AF;&#xB7;&#x8BFA;&#x4F9D;&#x66FC;&#x673A;&#x8FD0;&#x884C;&#x673A;&#x5236;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x5B83;&#x628A;&#x7A0B;&#x5E8F;&#x770B;&#x4F5C;&#x7531;&#x82E5;&#x5E72;&#x884C;&#x52A8;&#x6307;&#x4EE4;&#x7EC4;&#x6210;&#x7684;&#x6709;&#x5E8F;&#x5217;&#x8868;&#xFF0C;&#x5E76;&#x7528;&#x53D8;&#x91CF;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x7528;&#x8BED;&#x53E5;&#x6765;&#x6267;&#x884C;&#x6307;&#x4EE4;&#x3002;</p>
<p>&#x8FC7;&#x7A0B;&#x5F0F;&#x7F16;&#x7A0B;&#xFF08;procedural programming&#xFF09;&#x662F;&#x6307;&#x5F15;&#x5165;&#x4E86;&#x8FC7;&#x7A0B;&#xFF08;procedure&#xFF09;&#x3001;&#x51FD;&#x6570;&#xFF08;function&#xFF09;&#x6216;&#x5B50;&#x7A0B;&#x5E8F;&#xFF08;subroutine/subprogram&#xFF09;&#x7684;&#x547D;&#x4EE4;&#x5F0F;&#x7F16;&#x7A0B;&#x3002;</p>
<p>&#x7ED3;&#x6784;&#x5316;&#x7F16;&#x7A0B;&#x65F6;&#x8FC7;&#x7A0B;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x539F;&#x5219;&#xFF0C;&#x5176;&#x4E3B;&#x8981;&#x601D;&#x60F3;&#x662F;&#xFF1A;&#x63D0;&#x5021;&#x5728;&#x5B8F;&#x89C2;&#x4E0A;&#x91C7;&#x7528;&#x2018;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x2019;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5FAE;&#x89C2;&#x4E0A;&#x91C7;&#x7528;&#x987A;&#x5E8F;&#x3001;&#x9009;&#x62E9;&#x548C;&#x5FAA;&#x73AF;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#xFF0C;&#x6452;&#x5F03;&#x6216;&#x9650;&#x5236;<code>goto</code>&#x8BED;&#x53E5;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x6E05;&#x6670;&#x3001;&#x6613;&#x4E8E;&#x8C03;&#x8BD5;&#x548C;&#x7EF4;&#x62A4;&#x3002;</p></li>
<li><p>&#x547D;&#x4EE4;&#x5F0F;&#x7F16;&#x7A0B;&#x6A21;&#x62DF;&#x7535;&#x8111;&#x8FD0;&#x7B97;&#xFF0C;&#x662F;&#x884C;&#x52A8;&#x5BFC;&#x5411;&#xFF08;Action-Oriented&#xFF09;&#x7684;&#xFF0C;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x5B9A;&#x4E49;&#x89E3;&#x6CD5;&#xFF0C;&#x5373;&#x201C;&#x600E;&#x4E48;&#x505A;&#x201D;&#xFF0C;&#x56E0;&#x800C;&#x7B97;&#x6CD5;&#x662F;&#x663E;&#x6027;&#x800C;&#x76EE;&#x6807;&#x662F;&#x9690;&#x6027;&#x7684;&#xFF1B;&#x58F0;&#x660E;&#x5F0F;&#x7F16;&#x7A0B;&#x6A21;&#x62DF;&#x4EBA;&#x8111;&#x601D;&#x7EF4;&#xFF0C;&#x76EE;&#x6807;&#x9A71;&#x52A8;&#xFF08;Goal-Driven&#xFF09;&#x7684;&#xFF0C;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x63CF;&#x8FF0;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x201C;&#x505A;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x56E0;&#x800C;&#x76EE;&#x6807;&#x662F;&#x663E;&#x6027;&#x800C;&#x7B97;&#x6CD5;&#x662F;&#x9690;&#x6027;&#x7684;&#x3002;</p>
<ul>
<li><p>&#x547D;&#x4EE4;&#x5F0F; &#x2192; &#x8FC7;&#x7A0B;&#x5F0F; &#x2192; &#x7ED3;&#x6784;&#x5316;&#x8FC7;&#x7A0B;&#x5F0F;</p></li>
<li><p>&#x58F0;&#x660E;&#x5F0F; &#x2192; &#x51FD;&#x6570;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x6D41;&#x5F0F;&#xFF1B;&#x903B;&#x8F91;&#x5F0F;&#xFF0C;&#x7EA6;&#x675F;&#x5F0F;&#xFF1B;&#x5C5E;&#x6027;&#x5F0F;&#xFF1B;&#x6807;&#x8BB0;&#x5F0F;&#x3001;&#x89C4;&#x8303;&#x5F0F;&#x7B49;</p></li>
</ul>
<p>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#xFF1A;&#x901A;&#x8FC7;&#x6570;&#x5B66;&#x51FD;&#x6570;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x53D8;&#x6362;&#x548C;&#x8BA1;&#x7B97;&#x6765;&#x6C42;&#x503C;&#x3002;</p>
<p>&#x903B;&#x8F91;&#x5F0F;&#x7F16;&#x7A0B;&#xFF1A;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x4E8B;&#x5B9E;&#x548C;&#x89C4;&#x5219;&#xFF0C;&#x5229;&#x7528;&#x6570;&#x7406;&#x903B;&#x8F91;&#x6765;&#x63A8;&#x5BFC;&#x6216;&#x8BBA;&#x8BC1;&#x7ED3;&#x8BBA;&#x3002;</p></li>
<li><p>&#x547D;&#x4EE4;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x53D8;&#x91CF;&#x4EE3;&#x8868;&#x62BD;&#x8C61;&#x5316;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x5B58;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x6539;&#x53D8;&#xFF1B;&#x58F0;&#x660E;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x53D8;&#x91CF;&#x4EE3;&#x8868;&#x62BD;&#x8C61;&#x5316;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x6240;&#x6307;&#x5BF9;&#x8C61;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x3002;</p>
<ul>
<li><p>&#x58F0;&#x660E;&#x5F0F;&#x7F16;&#x7A0B;&#x4E13;&#x6CE8;&#x95EE;&#x9898;&#x7684;&#x5206;&#x6790;&#x4E0E;&#x8868;&#x8FBE;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0D;&#x7528;&#x6307;&#x660E;&#x6267;&#x884C;&#x987A;&#x5E8F;&#xFF0C;&#x4E00;&#x822C;&#x6CA1;&#x6709;&#x6216;&#x6781;&#x5C11;&#x6709;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x95EE;&#x9898;&#x3002;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x7F16;&#x7A0B;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x4E5F;&#x9002;&#x5408;&#x5E76;&#x53D1;&#x8BA1;&#x7B97;&#x3002;</p></li>
<li><p>&#x51FD;&#x6570;&#x5F0F;&#x8BED;&#x8A00;&#x548C;&#x903B;&#x8F91;&#x5F0F;&#x8BED;&#x8A00;&#x64C5;&#x957F;&#x6570;&#x7406;&#x903B;&#x8F91;&#x7684;&#x5E94;&#x7528;&#xFF1B;</p></li>
<li><p>&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x64C5;&#x957F;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4EA4;&#x4E92;&#x5F0F;&#x6216;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x578B;&#x5E94;&#x7528;&#x3002;</p></li>
</ul></li>
<li><p>&#x7F16;&#x7A0B;&#x662F;&#x5BFB;&#x6C42;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x5C06;&#x6307;&#x5B9A;&#x7684;&#x8F93;&#x5165;&#x8F6C;&#x5316;&#x4E3A;&#x6307;&#x5B9A;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<ul>
<li><p>&#x547D;&#x4EE4;&#x5F0F;&#xFF1A;&#x81EA;&#x52A8;&#x673A;&#x673A;&#x5236;&#xFF0C;&#x901A;&#x8FC7;&#x8BBE;&#x8BA1;&#x6307;&#x4EE4;&#x5B8C;&#x6210;&#x4ECE;&#x521D;&#x59CB;&#x6001;&#x5230;&#x6700;&#x7EC8;&#x6001;&#x7684;&#x8F6C;&#x53D8;&#xFF1B;</p></li>
<li><p>&#x51FD;&#x6570;&#x5F0F;&#xFF1A;&#x6570;&#x5B66;&#x53D8;&#x6362;&#x673A;&#x5236;&#xFF0C;&#x901A;&#x8FC7;&#x8BBE;&#x8BA1;&#x51FD;&#x6570;&#x5B8C;&#x6210;&#x4ECE;&#x81EA;&#x53D8;&#x91CF;&#x5230;&#x56E0;&#x53D8;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#xFF1B;</p></li>
<li><p>&#x903B;&#x8F91;&#x5F0F;&#xFF1A;&#x903B;&#x8F91;&#x8BC1;&#x660E;&#x673A;&#x5236;&#xFF0C;&#x901A;&#x8FC7;&#x903B;&#x8F91;&#x63A8;&#x7406;&#x5B8C;&#x6210;&#x4ECE;&#x9898;&#x8BBE;&#x5230;&#x7ED3;&#x8BBA;&#x7684;&#x8BC1;&#x660E;&#x3002;</p></li>
</ul></li>
<li><p>OOP&#xFF08;Object-Oriented programming&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x7F16;&#x7A0B;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x5C06;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x95EE;&#x9898;&#x7A7A;&#x95F4;&#x7684;&#x57FA;&#x672C;&#x5143;&#x7D20;&#xFF0C;&#x5229;&#x7528;&#x5BF9;&#x8C61;&#x548C;&#x5BF9;&#x8C61;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x6765;&#x8BBE;&#x8BA1;&#x7A0B;&#x5E8F;&#x3002;</p>
<ul>
<li><p>OOP&#x5927;&#x591A;&#x662F;&#x547D;&#x4EE4;&#x5F0F;&#xFF0C;&#x4E5F;&#x6709;&#x51FD;&#x6570;&#x5F0F;&#x548C;&#x903B;&#x8F91;&#x5F0F;&#x7684;OO&#x8BED;&#x8A00;&#x3002;</p></li>
<li><p>OOP&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x53EF;&#x4EE5;&#x5F52;&#x7EB3;&#x4E3A;&#xFF1A;&#x4EE5;&#x6570;&#x636E;&#x4E3A;&#x4E2D;&#x5FC3;&#x7EC4;&#x7EC7;&#x903B;&#x8F91;&#xFF0C;&#x5C06;&#x7CFB;&#x7EDF;&#x89C6;&#x4E3A;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x96C6;&#x5408;&#xFF0C;&#x5E76;&#x5229;&#x7528;&#x7EE7;&#x627F;&#x4E0E;&#x591A;&#x6001;&#x6765;&#x589E;&#x5F3A;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x4E0E;&#x53EF;&#x91CD;&#x7528;&#x6027;&#x3002;</p></li>
<li><p>&#x8FC7;&#x7A0B;&#x5F0F;&#x7F16;&#x7A0B;&#x4EE5;&#x8FC7;&#x7A0B;&#x4E3A;&#x4E2D;&#x5FC3;&#xFF0C;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#xFF0C;&#x9010;&#x6B65;&#x6C42;&#x7CBE;&#x3002;</p></li>
<li><p>&#x5BF9;&#x8C61;&#x5F0F;&#x7F16;&#x7A0B;&#x4EE5;&#x6570;&#x636E;&#x4E3A;&#x4E2D;&#x5FC3;&#xFF0C;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#xFF0C;&#x9010;&#x6B65;&#x5408;&#x5E76;&#x3002;</p></li>
<li><p>&#x8FC7;&#x7A0B;&#x5F0F;&#x7A0B;&#x5E8F;&#x7684;&#x4E16;&#x754C;&#x662F;&#x541B;&#x4E3B;&#x5236;&#xFF0C;OO&#x7A0B;&#x5E8F;&#x7684;&#x4E16;&#x754C;&#x662F;&#x6C11;&#x4E3B;&#x5236;&#x3002;</p></li>
<li><p>&#x5C01;&#x88C5;&#x4F7F;&#x5F97;&#x5BF9;&#x8C61;&#x62E5;&#x6709;&#x4E2A;&#x4F53;&#x8EAB;&#x4EFD;&#xFF0C;&#x7EE7;&#x627F;&#x4F7F;&#x5BF9;&#x8C61;&#x62E5;&#x6709;&#x5BB6;&#x5EAD;&#x8EAB;&#x4EFD;&#xFF0C;&#x591A;&#x6001;&#x4F7F;&#x5F97;&#x5BF9;&#x8C61;&#x62E5;&#x6709;&#x793E;&#x4F1A;&#x8EAB;&#x4EFD;&#x3002;</p></li>
</ul></li>
<li><p>&#x5E76;&#x6CD5;&#x5F0F;&#x7F16;&#x7A0B;&#x4EE5;&#x8FDB;&#x7A0B;&#x4E3A;&#x5BFC;&#x5411;&#xFF0C;&#x4EE5;&#x4EFB;&#x52A1;&#x4E3A;&#x4E2D;&#x5FC3;&#xFF0C;&#x4EE5;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#x4E0E;&#x7ADE;&#x4E89;&#x4E3A;&#x4E3B;&#x7EBF;&#x3002;</p>
<ul>
<li><p>&#x5E76;&#x6CD5;&#x5F0F;&#x7F16;&#x7A0B;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x3001;&#x5145;&#x5206;&#x5229;&#x7528;&#x8D44;&#x6E90;&#x3001;&#x63D0;&#x9AD8;&#x8F6F;&#x4EF6;&#x7684;&#x54CD;&#x5E94;&#x80FD;&#x529B;&#x3001;&#x6539;&#x5584;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3001;&#x4FDD;&#x8BC1;&#x516C;&#x5E73;&#x7ADE;&#x4E89;&#xFF0C;&#x540C;&#x65F6;&#x4EE5;&#x8FDB;&#x7A0B;&#x4E3A;&#x5355;&#x4F4D;&#x5C06;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x66F4;&#x52A0;&#x771F;&#x5B9E;&#x5730;&#x6A21;&#x62DF;&#x4E16;&#x754C;&#x3002;</p></li>
<li><p>&#x5408;&#x7406;&#x7684;&#x5E76;&#x53D1;&#x5F0F;&#x8BBE;&#x8BA1;&#x5E94;&#x8BE5;&#x505A;&#x5230;&#xFF1A;&#x8F6F;&#x4EF6;&#x6613;&#x4E8E;&#x91CD;&#x7528;&#x3001;&#x7EF4;&#x62A4;&#x548C;&#x6D4B;&#x8BD5;&#xFF1B;&#x6709;&#x6548;&#x5730;&#x5229;&#x7528;&#x8D44;&#x6E90;&#x3001;&#x4F18;&#x5316;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#xFF1B;&#x4FDD;&#x969C;&#x8FDB;&#x7A0B;&#x5B89;&#x5168;&#x548C;&#x6D3B;&#x6027;&#xFF1B;&#x51CF;&#x5C11;&#x6027;&#x80FD;&#x635F;&#x5931;&#x548C;&#x590D;&#x6742;&#x5EA6;&#x3002;</p></li>
</ul></li>
<li><table>
<thead>
<tr class="header">
<th>&#x8303;&#x5F0F;</th>
<th>&#x4F53;&#x7CFB;</th>
<th>&#x6A21;&#x5757;</th>
<th>&#x6A21;&#x5757;&#x5173;&#x7CFB;</th>
</tr>
</thead>
<tbody>
<tr class="odd">
<td>&#x8FC7;&#x7A0B;&#x5F0F;</td>
<td>&#x541B;&#x4E3B;&#x4F53;&#x7CFB;</td>
<td>&#x8FC7;&#x7A0B;</td>
<td>&#x6388;&#x547D;&#x4E0E;&#x542C;&#x547D;</td>
</tr>
<tr class="even">
<td>&#x51FD;&#x6570;&#x5F0F;</td>
<td>&#x6570;&#x5B66;&#x4F53;&#x7CFB;</td>
<td>&#x51FD;&#x6570;</td>
<td>&#x66FF;&#x6362;&#x4E0E;&#x5408;&#x6210;</td>
</tr>
<tr class="odd">
<td>&#x903B;&#x8F91;&#x5F0F;</td>
<td>&#x903B;&#x8F91;&#x4F53;&#x7CFB;</td>
<td>&#x65AD;&#x8A00;</td>
<td>&#x5F52;&#x7EB3;&#x4E0E;&#x6F14;&#x7ECE;</td>
</tr>
<tr class="even">
<td>&#x5BF9;&#x8C61;&#x5F0F;</td>
<td>&#x6C11;&#x4E3B;&#x4F53;&#x7CFB;</td>
<td>&#x5BF9;&#x8C61;</td>
<td>&#x4EA4;&#x6D41;&#x4E0E;&#x670D;&#x52A1;</td>
</tr>
<tr class="odd">
<td>&#x5E76;&#x53D1;&#x5F0F;</td>
<td>&#x751F;&#x4EA7;&#x4F53;&#x7CFB;</td>
<td>&#x8FDB;&#x7A0B;</td>
<td>&#x7ADE;&#x4E89;&#x4E0E;&#x5408;&#x4F5C;</td>
</tr>
</tbody>
</table></li>
<li><p>STL&#x6709;3&#x8981;&#x7D20;&#xFF1A;&#x7B97;&#x6CD5;&#xFF08;algorithms&#xFF09;&#x3001;&#x5BB9;&#x5668;&#xFF08;container&#xFF09;&#x548C;&#x8FED;&#x4EE3;&#x5668;&#xFF08;iterator&#xFF09;</p>
<ul>
<li><p>&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x5207;&#x5B9E;&#x6709;&#x6548;&#x7684;&#x6B65;&#x9AA4;&#xFF1B;</p></li>
<li><p>&#x5BB9;&#x5668;&#x662F;&#x6570;&#x636E;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x62BD;&#x8C61;&#x7684;&#x6570;&#x7EC4;&#xFF1B;</p></li>
<li><p>&#x8FED;&#x4EE3;&#x5668;&#x662F;&#x7B97;&#x6CD5;&#x4E0E;&#x5BB9;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x62BD;&#x8C61;&#x7684;&#x6307;&#x9488;&#x6216;&#x6E38;&#x6807;&#x3002;</p></li>
<li><p>&#x7B97;&#x6CD5;&#x4E32;&#x8054;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x810A;&#x8D2F;&#x8089;&#xFF1B;&#x6570;&#x636E;&#x5B9E;&#x4F53;&#x7B97;&#x6CD5;&#xFF0C;&#x5982;&#x8089;&#x9644;&#x810A;&#x3002;</p></li>
</ul></li>
<li><p>&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x80FD;&#x591F;&#x6253;&#x7834;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x58C1;&#x5792;&#xFF0C;&#x5728;&#x4E0D;&#x727A;&#x7272;&#x6548;&#x7387;&#x5E76;&#x5374;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x63D0;&#x5230;&#x7B97;&#x6CD5;&#x7684;&#x666E;&#x9002;&#x6027;&#x3002;</p>
<p>&#x6CDB;&#x578B;&#x53D8;&#x6210;&#x4E0D;&#x4EC5;&#x80FD;&#x6CDB;&#x5316;&#x7B97;&#x6CD5;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x6982;&#x5FF5;&#xFF08;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF09;&#xFF0C;&#x8FD8;&#x80FD;&#x6CDB;&#x5316;&#x884C;&#x4E3A;&#xFF08;&#x51FD;&#x6570;&#x3001;&#x65B9;&#x6CD5;&#x548C;&#x8FD0;&#x7B97;&#xFF09;&#x3002;</p>
<p>&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x662F;&#x4EE5;&#x7B97;&#x6CD5;&#x4E3A;&#x5BFC;&#x5411;&#x7684;&#xFF0C;&#x4EE5;&#x7B97;&#x6CD5;&#x4E3A;&#x4E2D;&#x5FC3;&#xFF0C;&#x9010;&#x6E10;&#x5C06;&#x5176;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x6982;&#x5FF5;&#x5185;&#x6DB5;&#x6A21;&#x7CCA;&#x5316;&#x3001;&#x5916;&#x5EF6;&#x6269;&#x5927;&#x5316;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x8FD0;&#x7B97;&#x62BD;&#x8C61;&#x5316;&#x3001;&#x4E00;&#x822C;&#x5316;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x7B97;&#x6CD5;&#x7684;&#x53EF;&#x91CD;&#x7528;&#x6027;&#x3002;</p></li>
<li><p>&#x9886;&#x57DF;&#x7279;&#x5B9A;&#x8BED;&#x8A00; DSL</p>
<ul>
<li>DSL &#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x4E00;&#x6B65;&#x5230;&#x4F4D;&#x5730;&#x7F16;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x6216;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x73B0;&#x6210;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x751F;&#x6210;&#x5668;&#xFF08;compiler-compiler &#x6216; compiler generator&#xFF09;&#x9996;&#x5148;&#x8F6C;&#x5316;&#x4E3A;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x3002;&#x8FD9;&#x6837;&#x4E0D;&#x4EC5;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x96BE;&#x5EA6;&#xFF0C;&#x4E5F;&#x65B9;&#x4FBF;&#x7A0B;&#x5E8F;&#x7684;&#x8C03;&#x8BD5;&#x3002;</li>
</ul></li>
<li><p>&#x5143;&#x7F16;&#x7A0B; Meta-programming</p>
<ul>
<li><p>&#x5143;&#x7F16;&#x7A0B;&#x662F;&#x7F16;&#x5199;&#x3001;&#x64CD;&#x7EB5;&#x7A0B;&#x5E8F;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x4F20;&#x7EDF;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD0;&#x7B97;&#x662F;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x4F46;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF1B;&#x5728;&#x5143;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E8C;&#x8005;&#x90FD;&#x662F;&#x52A8;&#x6001;&#x7684;&#x3002;</p></li>
<li><p>&#x5143;&#x7F16;&#x7A0B;&#x80FD;&#x591F;&#x51CF;&#x5C11;&#x624B;&#x5DE5;&#x7F16;&#x7A0B;&#xFF0C;&#x7A81;&#x7834;&#x539F;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x6CD5;&#x9650;&#x5236;&#xFF0C;&#x63D0;&#x5347;&#x8BED;&#x8A00;&#x7684;&#x62BD;&#x8C61;&#x7EA7;&#x522B;&#x4E0E;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x751F;&#x4EA7;&#x6548;&#x7387;&#x3002;</p></li>
<li><p>&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x3001;&#x6846;&#x67B6;&#x5F15;&#x64CE;&#x4E4B;&#x7C7B;&#x7684;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;&#x90FD;&#x6709;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5982;&#x8BB8;&#x591A;IDE&#x5982;Visual Studio&#x3001;Delphi&#x3001;Eclipse&#x5747;&#x80FD;&#x901A;&#x8FC7;&#x5411;&#x5BFC;&#x3001;&#x62D6;&#x653E;&#x63A7;&#x4EF6;&#x7B49;&#x65B9;&#x5F0F;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x6E90;&#x7801;&#xFF1B;Servlet&#x5F15;&#x64CE;&#x5C06; JSP&#x8F6C;&#x6362;&#x4E3A;Java&#x4EE3;&#x7801;&#x3002;&#x521B;&#x9020;DSL&#x4EE5;&#x4FBF;&#x9AD8;&#x6548;&#x5730;&#x5904;&#x7406;&#x4E13;&#x95E8;&#x9886;&#x57DF;&#x4E1A;&#x52A1;&#x3002;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#xFF0C;&#x52A8;&#x6001;&#x6539;&#x53D8;&#x8BED;&#x53E5;&#x3001;&#x51FD;&#x6570;&#x3001;&#x7C7B;&#x7B49;&#x3002;</p></li>
</ul></li>
<li><p>SoC &#x5C31;&#x662F; Separation of Concerns&#xFF0C;&#x5373;&#x5173;&#x6CE8;&#x70B9;&#x5206;&#x79BB;&#xFF1B;DRY&#x5C31;&#x662F;Don&apos;t repeat yourself&#xFF0C;&#x5373;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x4E0D;&#x826F;&#x4EE3;&#x7801;&#x901A;&#x75C5;&#xFF1A;&#x2460; &#x7ED3;&#x6784;&#x6DF7;&#x4E71;&#x6216;&#x4EE3;&#x7801;&#x7D0A;&#x4E71;&#x3001;&#x677E;&#x6563;&#xFF1B;&#x2461; &#x4EE3;&#x7801;&#x91CD;&#x590D;&#x3002;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x8981;&#x505A;&#x5230;&#x2014;&#x2014;&#x62BD;&#x8C61;&#x4E0E;&#x5206;&#x79BB;&#x539F;&#x5219;&#x3002;</p>
<p>&#x62BD;&#x8C61;&#x4E0E;&#x5206;&#x89E3;&#x7684;&#x539F;&#x5219;&#xFF1A;&#x5355;&#x4E00;&#x5316;&#x3001;&#x6B63;&#x4EA4;&#x5316;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x804C;&#x8D23;&#x660E;&#x786E;&#x4E13;&#x4E00;&#xFF0C;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x72EC;&#x7ACB;&#xFF0C;&#x5373;&#x9AD8;&#x5185;&#x805A;&#x4F4E;&#x8026;&#x5408;&#xFF08;high cohesion &amp; low coupling&#xFF09;&#x3002;</p></li>
<li><p>AOP</p>
<ul>
<li><p>&#x5207;&#x9762; Aspect &#x63CF;&#x8FF0;&#x7684;&#x662F;&#x6A2A;&#x5207;&#x5173;&#x6CE8;&#x70B9;&#xFF08;cross-cutting concerns&#xFF09;&#xFF0C;&#x662F;&#x4E0E;&#x7A0B;&#x5E8F;&#x7EB5;&#x5411;&#x4E3B;&#x6D41;&#x6267;&#x884C;&#x65B9;&#x5411;&#x6A2A;&#x5411;&#x6B63;&#x4EA4;&#x7684;&#x5173;&#x6CE8;&#x7126;&#x70B9;&#x3002;</p></li>
<li><p>&#x63A5;&#x5165;&#x70B9;&#x662F;&#x9644;&#x52A0;&#x884C;&#x4E3A;&#x2014;&#x2014;&#x5EFA;&#x8BAE;&#xFF08;advice&#xFF09;&#x7684;&#x6267;&#x884C;&#x70B9;&#xFF0C;&#x5207;&#x5165;&#x70B9;&#xFF08;pointcut&#xFF09;&#x662F;&#x6307;&#x5207;&#x5165;&#x70B9;&#xFF08;join point&#xFF09;&#x7ED3;&#x5408;&#x3002;&#x8FD9;&#x4E9B;&#x63A5;&#x5165;&#x70B9;&#x5171;&#x4EAB;&#x4E00;&#x6BB5;&#x63D2;&#x5165;&#x4EE3;&#x7801;&#x3002;&#x5207;&#x5165;&#x70B9;&#x4E0E;&#x5EFA;&#x8BAE;&#x7EC4;&#x6210;&#x5207;&#x9762;&#xFF08;aspect&#xFF09;&#xFF0C;&#x662F;&#x6A21;&#x5757;&#x5316;&#x7684;&#x6A2A;&#x5207;&#x5173;&#x6CE8;&#x70B9;&#x3002;</p></li>
<li><p>AOP&#x7684;&#x5B9E;&#x73B0;&#x539F;&#x7406;&#xFF1A;</p>
<p>AOP&#x7684;&#x5B9E;&#x73B0;&#x5173;&#x952E;&#x662F;&#x5C06;advice&#x7684;&#x4EE3;&#x7801;&#x5D4C;&#x5165;&#x5230;&#x4E3B;&#x9898;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x672F;&#x8BED;&#x79F0;&#x4E4B;&#x4E3A;&#x7F16;&#x7EC7;&#xFF08;weaving&#xFF09;&#x3002;&#x7F16;&#x7EC7;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x79CD;&#xFF1A;&#x4E00;&#x79CD;&#x662F;&#x9759;&#x6001;&#x7F16;&#x7EC7;&#xFF0C;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x6E90;&#x7801;&#x6216;&#x5B57;&#x8282;&#x7801;&#xFF08;bytecode&#xFF09;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#xFF08;compile-time&#xFF09;&#x3001;&#x540E;&#x7F16;&#x8BD1;&#x5668;&#xFF08;post-compile&#xFF09;&#x6216;&#x52A0;&#x8F7D;&#x5668;&#xFF08;load-time&#xFF09;&#x5D4C;&#x5165;&#x4EE3;&#x7801;&#xFF08;&#x5143;&#x7F16;&#x7A0B;&#x3001;&#x4EA7;&#x751F;&#x5F0F;&#x7F16;&#x7A0B;&#x5B9E;&#x73B0;&#xFF09;&#xFF1B;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x52A8;&#x6001;&#x7F16;&#x7EC7;&#xFF0C;&#x901A;&#x8FC7;&#x4EE3;&#x7406;&#xFF08;proxy&#xFF09;&#x7B49;&#x6280;&#x672F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF08;run-time&#xFF09;&#x5B9E;&#x73B0;&#x5D4C;&#x5165;&#x3002;</p></li>
<li><p>AOP&#x5B9E;&#x65BD;&#x7684;3&#x6B65;&#xFF1A;&#x5207;&#x9762;&#x5206;&#x89E3;&#x3001;&#x5207;&#x9762;&#x5B9E;&#x73B0;&#x548C;&#x5207;&#x9762;&#x5408;&#x6210;&#x3002;</p></li>
</ul></li>
<li><p>&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;</p>
<ul>
<li><p>&#x91C7;&#x7528;&#x8B66;&#x89C9;&#x5F0F;&#x8005;&#x4E3B;&#x52A8;&#x53BB;&#x8F6E;&#x8BE2;&#xFF08;polling&#xFF09;&#xFF0C;&#x884C;&#x4E3A;&#x53D6;&#x51B3;&#x4E8E;&#x81EA;&#x8EAB;&#x7684;&#x89C2;&#x5BDF;&#x5224;&#x65AD;&#xFF0C;&#x662F;&#x6D41;&#x7A0B;&#x9A71;&#x52A8;&#x7684;&#xFF0C;&#x7B26;&#x5408;&#x5E38;&#x89C4;&#x7684;&#x6D41;&#x7A0B;&#x9A71;&#x52A8;&#x5F0F;&#x7F16;&#x7A0B;&#xFF08;Flow-Driven Programming&#xFF09;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p></li>
<li><p>&#x91C7;&#x7528;&#x6258;&#x4ED8;&#x5F0F;&#x8005;&#x88AB;&#x52A8;&#x7B49;&#x901A;&#x77E5;&#xFF08;notification&#xFF09;&#xFF0C;&#x884C;&#x4E3A;&#x53D6;&#x51B3;&#x4E8E;&#x5916;&#x6765;&#x7684;&#x7A81;&#x53D1;&#x4E8B;&#x4EF6;&#xFF0C;&#x662F;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#xFF0C;&#x7B26;&#x5408;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x5F0F;&#x7F16;&#x7A0B;&#xFF08;Event-Driven Programming&#xFF0C; aka EDP&#xFF09;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p></li>
</ul>
<p><strong>&#x4F55;&#x4E3A;&#x4E8B;&#x4EF6;&#xFF1F;</strong></p>
<p>&#x4E8B;&#x4EF6;&#x662F;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x7684;&#x67D0;&#x79CD;&#x4EE4;&#x4EBA;&#x5173;&#x6CE8;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x5728;&#x8F6F;&#x4EF6;&#x4E2D;&#xFF0C;&#x5B83;&#x4E00;&#x822C;&#x8868;&#x73B0;&#x4E3A;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x67D0;&#x4E9B;&#x4FE1;&#x606F;&#x72B6;&#x6001;&#x4E0A;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
<p><strong>&#x4E8B;&#x4EF6;&#x5206;&#x7C7B;&#xFF1A;</strong></p>
<p>&#x5185;&#x5EFA;&#x4E8B;&#x4EF6;&#xFF08;built-in event&#xFF09;&#xFF1A;</p>
<ul>
<li><p>&#x5E95;&#x5C42;&#x4E8B;&#x4EF6;&#xFF08;low-level event&#xFF09;&#x6216;&#x539F;&#x751F;&#x4E8B;&#x4EF6;&#xFF08;native event&#xFF09;</p>
<p>&#x5728;&#x7528;&#x6237;&#x56FE;&#x5F62;&#x754C;&#x9762;&#xFF08;GUI&#xFF09;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x7C7B;&#x4E8B;&#x4EF6;&#x7531;&#x9F20;&#x6807;&#x3001;&#x952E;&#x76D8;&#x7B49;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x51FA;&#x53D1;&#xFF1B;</p></li>
<li><p>&#x8BED;&#x4E49;&#x4E8B;&#x4EF6;&#xFF08;semantic event&#xFF09;</p>
<p>&#x4E00;&#x822C;&#x4EE3;&#x8868;&#x7528;&#x6237;&#x7684;&#x884C;&#x4E3A;&#x903B;&#x8F91;&#xFF0C;&#x662F;&#x82E5;&#x5E72;&#x4E2A;&#x5E95;&#x5C42;&#x4E8B;&#x4EF6;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x6BD4;&#x5982;&#x9F20;&#x6807;&#x7684;&#x62D6;&#x653E;&#xFF08;drag-and-drop&#xFF09;&#x591A;&#x8868;&#x793A;&#x79FB;&#x52A8;&#x88AB;&#x62D6;&#x653E;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7531;&#x9F20;&#x6807;&#x6309;&#x4E0B;&#x3001;&#x79FB;&#x52A8;&#x548C;&#x91CA;&#x653E;&#x4E09;&#x4E2A;&#x5E95;&#x5C42;&#x4E8B;&#x4EF6;&#x7EC4;&#x6210;&#x3002;</p></li>
</ul>
<p>&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x4E8B;&#x4EF6;&#xFF08;user-defined event&#xFF09;&#xFF1A;</p>
<ul>
<li><p>&#x865A;&#x62DF;&#x4E8B;&#x4EF6;&#xFF08;virtual event&#xFF09;</p></li>
<li><p>&#x539F;&#x6709;&#x5185;&#x5EFA;&#x4E8B;&#x4EF6;&#x57FA;&#x7840;&#x4E0A;&#x7684;&#x5305;&#x88C5;&#x3002;</p></li>
</ul>
<p>&#x6B64;&#x5916;&#xFF0C;&#x4E8B;&#x4EF6;&#x8FD8;&#x6709;&#x81EA;&#x7136;&#x4E8B;&#x4EF6;&#xFF08;natural event&#xFF09;&#x548C;&#x5408;&#x6210;&#x4E8B;&#x4EF6;&#xFF08;synthetic event&#xFF09;&#x3002;</p>
<p><strong>&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x6B65;&#x9AA4;&#xFF1A;</strong></p>
<p>&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#xFF1B;&#x6CE8;&#x518C;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#xFF1B;&#x5B9E;&#x73B0;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x3002;</p>
<p><strong>&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x5F0F;&#x7684;&#x7279;&#x5F81;</strong>&#xFF1A;</p>
<p>&#x88AB;&#x52A8;&#x6027;&#x4E0E;&#x5F02;&#x6B65;&#x6027;&#x3002;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x5BFC;&#x81F4;&#x4E86;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;****&#x88AB;&#x52A8;&#x6027;passivity<strong>&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x5F0F;&#x7F16;&#x7A0B;&#x8FD8;&#x5177;&#x6709;</strong>&#x5F02;&#x6B65;&#x6027;&#xFF08;asynchrony&#xFF09;** &#x7684;&#x7279;&#x5F81;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x4E8B;&#x4EF6;&#x7684;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x6027;&#x548C;&#x968F;&#x673A;&#x6027;&#x51B3;&#x5B9A;&#x7684;&#x3002;</p></li>
<li><p>&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF08;callback&#xFF09;</p>
<ul>
<li><p>Callback&#x662F;&#x6307;&#x80FD;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7684;&#x51FD;&#x6570;&#x6216;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5E95;&#x5C42;&#x6A21;&#x5757;&#x8C03;&#x7528;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x4F7F;&#x8C03;&#x7528;&#x8005;&#x4E0E;&#x88AB;&#x8C03;&#x8005;&#x4ECE;&#x4EE3;&#x7801;&#x4E0A;&#x89E3;&#x8026;&#x3002;&#x5F02;&#x6B65;Callback&#x5728;&#x4F20;&#x5165;&#x540E;&#x5E76;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x8C03;&#x7528;&#xFF0C;&#x4F7F;&#x8C03;&#x7528;&#x8005;&#x4E0E;&#x88AB;&#x8C03;&#x8005;&#x4ECE;&#x65F6;&#x95F4;&#x4E0A;&#x89E3;&#x8026;&#x3002;</p></li>
<li><p>&#x5728;C&#x3001;CPP&#x4E2D;&#x51FD;&#x6570;&#x6307;&#x9488;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;callback&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x62BD;&#x8C61;&#x7C7B;&#xFF08;abstract class&#xFF09;&#x3001;&#x63A5;&#x53E3;&#xFF08;interface&#xFF09;&#x3001;CPP&#x4E2D;&#x7684;&#x6CDB;&#x578B;&#x51FD;&#x5B50;&#xFF08;generic functor&#xFF09;&#x548C;C#&#x4E2D;&#x7684;&#x59D4;&#x6258;&#xFF08;delegate&#xFF09;&#x90FD;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;callback&#x3002;</p></li>
</ul></li>
<li><p>&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x4E00;&#x822C;&#x901A;&#x8FC7;callback&#x5B9E;&#x73B0;&#xFF0C;&#x5176;&#x76EE;&#x7684;&#x662F;&#x964D;&#x4F4E;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x6A21;&#x5757;&#x7684;&#x8026;&#x5408;&#x5EA6;&#x548C;&#x590D;&#x6742;&#x5EA6;&#x3002;</p>
<p>&#x4F9D;&#x8D56;&#x53CD;&#x8F6C;&#x3001;&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#x548C;&#x4F9D;&#x8D56;&#x6CE8;&#x5C04;&#x662F;&#x8FD1;&#x4E49;&#x8BCD;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4E3B;&#x9898;&#x662F;&#x63A7;&#x5236;&#x4E0E;&#x4F9D;&#x8D56;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x89E3;&#x8026;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x53CD;&#x8F6C;&#xFF0C;&#x5B9E;&#x73B0;&#x4E00;&#x5207;&#x7684;&#x5173;&#x952E;&#x662F;&#x62BD;&#x8C61;&#x63A5;&#x53E3;&#x3002;</p>
<p><strong>&#x4F9D;&#x8D56;&#x53CD;&#x8F6C;&#x539F;&#x5219;</strong>&#xFF08;Dependency-Inversion Principle&#xFF0C;aka DIP&#xFF09;&#x4E0E;<strong>&#x63A7;&#x5236;&#x53CD;&#x8F6C;</strong>&#x76F8;&#x6BD4;&#x66F4;&#x52A0;&#x5177;&#x4F53;&#x2014;&#x2014;&#x9AD8;&#x5C42;&#x6A21;&#x5757;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x4F4E;&#x5C42;&#x6A21;&#x5757;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x5E94;&#x4F9D;&#x8D56;&#x62BD;&#x8C61;&#xFF1B;&#x62BD;&#x8C61;&#x4E0D;&#x5E94;&#x4F9D;&#x8D56;&#x4E8E;&#x7EC6;&#x8282;&#xFF0C;&#x7EC6;&#x8282;&#x5E94;&#x8BE5;&#x4F9D;&#x8D56;&#x62BD;&#x8C61;&#x3002;</p>
<p>&#x4F9D;&#x8D56;&#x6CE8;&#x5C04;&#xFF08;Dependency Injection&#xFF0C;aka DI&#xFF09;&#x2014;&#x2014;&#x52A8;&#x6001;&#x5730;&#x4E3A;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x7EC4;&#x4EF6;&#x63D0;&#x4F9B;&#x5916;&#x90E8;&#x4F9D;&#x8D56;&#x3002;</p></li>
<li><p>&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x60F3;&#xFF08;scalability&#xFF09;&#x4E00;&#x822C;&#x6307;&#x4ECE;&#x5BB9;&#x5E94;&#x5BF9;&#x5DE5;&#x4F5C;&#x91CF;&#x589E;&#x957F;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5E38;&#x4E0E;&#x6027;&#x80FD;&#xFF08;performance&#xFF09;&#x7B49;&#x6307;&#x6807;&#x4E00;&#x8D77;&#x8003;&#x91CF;&#x3002;&#x800C;<strong>&#x63A7;&#x5236;&#x53CD;&#x8F6C;</strong>&#x7684;&#x4E3B;&#x8981;&#x4F5C;&#x7528;&#x662F;&#x964D;&#x4F4E;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x6A21;&#x5757;&#x7684;&#x8026;&#x5408;&#x5EA6;&#x548C;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x63D0;&#x9AD8;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x91CD;&#x7528;&#x6027;&#x3001;&#x67D4;&#x97E7;&#x6027;&#x548C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;</p></li>
<li><p>&#x72EC;&#x7ACB;&#x662F;&#x5F02;&#x6B65;&#x7684;&#x524D;&#x63D0;&#xFF0C;&#x8017;&#x65F6;&#x662F;&#x5F02;&#x6B65;&#x7684;&#x7406;&#x7531;&#x3002;</p></li>
<li><p>&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x53C8;&#x79F0;&#x4E3A;&#x53D1;&#x884C;/&#x8BA2;&#x9605;&#x6A21;&#x5F0F;&#xFF0C;&#x65E2;&#x662F;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x5F0F;&#x7684;&#x7B80;&#x5316;&#xFF0C;&#x4E5F;&#x662F;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x3002;MVC&#x67B6;&#x6784;&#x662F;&#x89C2;&#x5BDF;&#x8005;&#x6A21;&#x5F0F;&#x5728;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x3002;</p></li>
<li><p>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x662F;&#x7A0B;&#x5E8F;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x662F;&#x5934;&#x7B49;&#x516C;&#x6C11;&#xFF0C;&#x4E00;&#x822C;&#x6CA1;&#x6709;&#x8D27;&#x5F88;&#x5C11;&#x6709;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x540C;&#x65F6;&#x6CA1;&#x6709;&#x663E;&#x793A;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x6CA1;&#x6709;&#x526F;&#x4F5C;&#x7528;&#xFF08;side affect&#xFF09;&#x7684;&#x597D;&#x5904;&#xFF1A;</p>
<ul>
<li><p>&#x6CA1;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x51FD;&#x6570;&#x6613;&#x4E8E;&#x91CD;&#x6784;&#x3001;&#x8C03;&#x8BD5;&#x548C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;</p></li>
<li><p>&#x4EE3;&#x7801;&#x6709;&#x6548;&#x6027;&#x4E0E;&#x51FD;&#x6570;&#x987A;&#x5E8F;&#x65E0;&#x5173;&#xFF0C;&#x65B9;&#x4FBF;&#x5E76;&#x53D1;&#x5904;&#x7406;&#x548C;&#x4F18;&#x5316;&#x5904;&#x7406;&#x3002;</p></li>
</ul>
<p>&#x6CA1;&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x51FD;&#x6570;&#x5F0F;&#x662F;&#x5F15;&#x7528;&#x900F;&#x660E;&#x7684;&#xFF08;referential transparency&#xFF09;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x968F;&#x65F6;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x7684;&#x503C;&#x6765;&#x66FF;&#x6362;&#xFF0C;&#x5982;&#x6570;&#x5B66;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x4E00;&#x6837;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x6570;&#x5B66;&#x601D;&#x7EF4;&#x7684;&#x8D2F;&#x5F7B;&#x4E0E;&#x8FD0;&#x7528;&#x3002;</p>
<p>&#x60F0;&#x6027;&#x6C42;&#x503C;&#x662F;&#x9700;&#x6C42;&#x9A71;&#x52A8;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x7B49;&#x5F85;&#x548C;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4E8E;&#x8FC7;&#x7A0B;&#x5F0F;&#x548C;OOP&#xFF0C;&#x51FD;&#x6570;&#x5F0F;&#x601D;&#x60F3;&#x8FC7;&#x4E8E;&#x6570;&#x5B66;&#x5316;&#x548C;&#x62BD;&#x8C61;&#x5316;&#xFF0C;&#x8BED;&#x8A00;&#x8868;&#x73B0;&#x529B;&#x548C;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x4E5F;&#x4E0D;&#x8DB3;&#x3002;</p></li>
<li><p>&#x4EE3;&#x7801;&#x7684;&#x957F;&#x5EA6;&#x4E0D;&#x662F;&#x8861;&#x91CF;&#x8F6F;&#x4EF6;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x552F;&#x4E00;&#x6807;&#x51C6;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x8D8A;&#x590D;&#x6742;&#x3001;&#x8D8A;&#x5FAE;&#x5999;&#x3001;&#x53D7;&#x9700;&#x6C42;&#x53D8;&#x5316;&#x5F71;&#x54CD;&#x8D8A;&#x5927;&#xFF0C;&#x8F6F;&#x4EF6;&#x8D8A;&#x96BE;&#x63A7;&#x5236;&#x548C;&#x7EF4;&#x62A4;&#x3002;</p>
<p><strong>&#x7B97;&#x6CD5;=&#x903B;&#x8F91;+&#x63A7;&#x5236;</strong> &#x3002;&#x903B;&#x8F91;&#x5F0F;&#x7F16;&#x7A0B;&#x5C06;&#x7B97;&#x6CD5;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x90E8;&#x5206;&#x5927;&#x90FD;&#x79FB;&#x4EA4;&#x7ED9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x7B97;&#x6CD5;&#x7684;&#x6838;&#x5FC3;&#x903B;&#x8F91;&#x3002;&#x8FD9;&#x6837;&#x5927;&#x5927;&#x51CF;&#x8F7B;&#x4E86;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x7F16;&#x7801;&#x4E5F;&#x66F4;&#x52A0;&#x7B80;&#x6D01;&#xFF0C;&#x66F4;&#x5177;&#x6709;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x548C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;</p>
<ul>
<li><p>&#x533A;&#x522B;&#x4E8E;&#x8FC7;&#x7A0B;&#x5F0F;&#x548C;&#x51FD;&#x6570;&#x5F0F;&#xFF0C;&#x903B;&#x8F91;&#x5F0F;&#x6CA1;&#x6709;&#x660E;&#x663E;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;</p></li>
<li><p>&#x903B;&#x8F91;&#x5F0F;&#x7F16;&#x7A0B;&#x4E0D;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x65B9;&#x9762;&#x7684;&#x5B66;&#x672F;&#x9886;&#x57DF;&#xFF0C;&#x8FD8;&#x5E7F;&#x6CDB;&#x9002;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x8BBE;&#x8BA1;&#x77E5;&#x8BC6;&#x7BA1;&#x7406;&#x3001;&#x51B3;&#x7B56;&#x5206;&#x6790;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x3002;</p></li>
</ul></li>
<li><p>&#x76F8;&#x6BD4;&#x4E8E;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#x9488;&#x5BF9;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x66F4;&#x5E7F;&#x6CDB;&#xFF0C;&#x63D0;&#x51FA;&#x7684;&#x601D;&#x60F3;&#x548C;&#x65B9;&#x6CD5;&#x66F4;&#x4E3A;&#x666E;&#x904D;&#x9002;&#x7528;&#x3001;&#x66F4;&#x62BD;&#x8C61;&#x3001;&#x66F4;&#x7CFB;&#x7EDF;&#x3002;&#x6B64;&#x5916;&#xFF0C; &#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x91CD;&#x5728;&#x8BBE;&#x8BA1;&#xFF0C;&#x5BF9;&#x8BED;&#x8A00;&#x548C;&#x5DE5;&#x5177;&#x8981;&#x6C42;&#x4E0D;&#x9AD8;&#xFF0C;&#x800C;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#x8981;&#x6C42;&#x5EFA;&#x7ACB;&#x4E00;&#x5957;&#x62BD;&#x8C61;&#x673A;&#x5236;&#x548C;&#x65B9;&#x6CD5;&#x4F53;&#x7CFB;&#xFF0C;&#x79BB;&#x4E0D;&#x5F00;&#x8BED;&#x8A00;&#x6216;&#x5DE5;&#x5177;&#x7684;&#x652F;&#x6301;&#x3002;</p>
<ul>
<li>&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#x7684;&#x6838;&#x5FC3;&#x4EF7;&#x503C;&#x5728;&#x4E8E;&#xFF1A;&#x7A81;&#x7834;&#x539F;&#x6709;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#x7684;&#x67D0;&#x4E9B;&#x9650;&#x5236;&#xFF0C;&#x5E26;&#x6765;&#x65B0;&#x601D;&#x7EF4;&#x548C;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x4E00;&#x6B65;&#x89E3;&#x653E;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x52B3;&#x52A8;&#x529B;&#x3002;</li>
</ul></li>
<li><p>&#x95ED;&#x5305;&#x662F;&#x4E00;&#x79CD;&#x80FD;&#x4FDD;&#x5B58;&#x5F53;&#x521D;&#x521B;&#x5EFA;&#x65F6;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x4EE5;&#x533F;&#x540D;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#xFF0C;&#x591A;&#x7528;&#x4E8E;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x7B80;&#x6D01;&#x3002;Java&#x4E2D;&#x7684;&#x533F;&#x540D;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;OO&#x5316;&#x7684;&#x95ED;&#x5305;&#x5F62;&#x5F0F;&#x3002;</p></li>
<li><p>&#x6240;&#x8C13;&#x8FED;&#x4EE3;&#x5B66;&#x4E60;&#x6CD5;&#xFF0C;&#x662F;&#x6307;&#x5728;&#x5177;&#x4F53;&#x77E5;&#x8BC6;&#x548C;&#x62BD;&#x8C61;&#x7406;&#x8BBA;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x589E;&#x91CF;&#x5F0F;&#x7684;&#x5FAA;&#x73AF;&#x5B66;&#x4E60;&#x3002;</p></li>
</ol>
<p>// todo. &#x7EE7;&#x7EED;&#x6574;&#x7406;&#x7B2C;&#x4E94;&#x8BFE; &#x8BED;&#x8A00;&#x5C0F;&#x8C08;</p>
</div><div class="article-tags size-small mb-4"><span class="mr-2">#</span><a class="link-muted mr-2" rel="tag" href="/tags/%E7%BC%96%E7%A8%8B%E8%8C%83%E5%BC%8F/">编程范式</a></div><div class="sharethis-inline-share-buttons"></div><script src="https://platform-api.sharethis.com/js/sharethis.js#property=5ed77c944764050012743e2b&amp;product=inline-share-buttons" defer></script></article></div><!--!--><nav class="post-navigation mt-4 level is-mobile"><div class="level-start"><a class="article-nav-prev level level-item link-muted" href="/2020/06/10/%E5%86%92%E5%8F%B7%E8%AF%BE%E5%A0%82%E7%AC%94%E8%AE%B0-5-6/"><i class="level-item fas fa-chevron-left"></i><span class="level-item">冒号课堂笔记(5-6课)</span></a></div><div class="level-end"><a class="article-nav-next level level-item link-muted" href="/2020/05/15/%E7%AE%97%E6%B3%95%E6%95%B0%E5%AD%A6%E5%9F%BA%E7%A1%80-3/"><span class="level-item">算法数学基础 - 3</span><i class="level-item fas fa-chevron-right"></i></a></div></nav><div class="card"><div class="card-content"><h3 class="title is-5">Comentarios</h3><div id="disqus_thread"><noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript></div><script>var disqus_config = function () {
            this.page.url = 'http://www.hoooo.org/2020/05/17/%E5%86%92%E5%8F%B7%E8%AF%BE%E5%A0%82%E7%AC%94%E8%AE%B0-1-4/';
            this.page.identifier = '2020/05/17/冒号课堂笔记-1-4/';
        };
        (function() {
            var d = document, s = d.createElement('script');  
            s.src = '//' + 'hoo' + '.disqus.com/embed.js';
            s.setAttribute('data-timestamp', +new Date());
            (d.head || d.body).appendChild(s);
        })();</script></div></div></div><div class="column column-left is-4-tablet is-4-desktop is-4-widescreen  order-1"><div class="card widget"><div class="card-content"><nav class="level"><div class="level-item has-text-centered flex-shrink-1"><div><figure class="image is-128x128 mx-auto mb-2"><img class="avatar is-rounded" src="https://cdn.jsdelivr.net/gh/bxtx999/Image-Hosting/img/20200603184421.jpg" alt="Hoooo"></figure><p class="title is-size-4 is-block line-height-inherit">Hoooo</p><p class="is-size-6 is-block">Student</p><p class="is-size-6 is-flex justify-content-center"><i class="fas fa-map-marker-alt mr-1"></i><span>China</span></p></div></div></nav><nav class="level is-mobile"><div class="level-item has-text-centered is-marginless"><div><p class="heading">Entradas</p><a href="/archives"><p class="title">25</p></a></div></div><div class="level-item has-text-centered is-marginless"><div><p class="heading">Categorías</p><a href="/categories"><p class="title">12</p></a></div></div><div class="level-item has-text-centered is-marginless"><div><p class="heading">Etiquetas</p><a href="/tags"><p class="title">28</p></a></div></div></nav><div class="level"><a class="level-item button is-primary is-rounded" href="https://github.com/bxtx999" target="_blank" rel="noopener">SEGUIR</a></div><div class="level is-mobile"><a class="level-item button is-transparent is-marginless" target="_blank" rel="noopener" title="Github" href="https://github.com/bxtx999"><i class="fab fa-github"></i></a><a class="level-item button is-transparent is-marginless" target="_blank" rel="noopener" title="RSS" href="/"><i class="fas fa-rss"></i></a></div></div></div><!--!--><div class="card widget"><div class="card-content"><div class="menu"><h3 class="menu-label">Categorías</h3><ul class="menu-list"><li><a class="level is-mobile is-marginless" href="/categories/Javascript/"><span class="level-start"><span class="level-item">Javascript</span></span><span class="level-end"><span class="level-item tag">1</span></span></a><ul class="mr-0"><li><a class="level is-mobile is-marginless" href="/categories/Javascript/WebGPU/"><span class="level-start"><span class="level-item">WebGPU</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li></ul></li><li><a class="level is-mobile is-marginless" href="/categories/OS/"><span class="level-start"><span class="level-item">OS</span></span><span class="level-end"><span class="level-item tag">3</span></span></a><ul class="mr-0"><li><a class="level is-mobile is-marginless" href="/categories/OS/Linux/"><span class="level-start"><span class="level-item">Linux</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/OS/%E8%AE%A1%E7%AE%97%E6%9C%BA%E6%80%A7%E8%83%BD/"><span class="level-start"><span class="level-item">计算机性能</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li></ul></li><li><a class="level is-mobile is-marginless" href="/categories/Python/"><span class="level-start"><span class="level-item">Python</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E5%9B%BE%E8%B1%A1%E5%A4%84%E7%90%86/"><span class="level-start"><span class="level-item">图象处理</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E7%94%9F%E6%B4%BB/"><span class="level-start"><span class="level-item">生活</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E7%A4%BE%E4%BC%9A%E8%AE%A1%E7%AE%97/"><span class="level-start"><span class="level-item">社会计算</span></span><span class="level-end"><span class="level-item tag">6</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E7%AE%97%E6%B3%95/"><span class="level-start"><span class="level-item">算法</span></span><span class="level-end"><span class="level-item tag">6</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E7%BC%96%E7%A8%8B/"><span class="level-start"><span class="level-item">编程</span></span><span class="level-end"><span class="level-item tag">3</span></span></a></li><li><a class="level is-mobile is-marginless" href="/categories/%E8%BF%90%E7%AD%B9%E5%AD%A6/"><span class="level-start"><span class="level-item">运筹学</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li></ul></div></div></div><div class="card widget"><div class="card-content"><div class="menu"><h3 class="menu-label">Archivos</h3><ul class="menu-list"><li><a class="level is-mobile is-marginless" href="/archives/2020/10/"><span class="level-start"><span class="level-item">October 2020</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/09/"><span class="level-start"><span class="level-item">September 2020</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/08/"><span class="level-start"><span class="level-item">August 2020</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/06/"><span class="level-start"><span class="level-item">June 2020</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/05/"><span class="level-start"><span class="level-item">May 2020</span></span><span class="level-end"><span class="level-item tag">5</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/04/"><span class="level-start"><span class="level-item">April 2020</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2020/03/"><span class="level-start"><span class="level-item">March 2020</span></span><span class="level-end"><span class="level-item tag">4</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2018/07/"><span class="level-start"><span class="level-item">July 2018</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2018/06/"><span class="level-start"><span class="level-item">June 2018</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2018/04/"><span class="level-start"><span class="level-item">April 2018</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2017/12/"><span class="level-start"><span class="level-item">December 2017</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2017/01/"><span class="level-start"><span class="level-item">January 2017</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2016/11/"><span class="level-start"><span class="level-item">November 2016</span></span><span class="level-end"><span class="level-item tag">1</span></span></a></li><li><a class="level is-mobile is-marginless" href="/archives/2016/04/"><span class="level-start"><span class="level-item">April 2016</span></span><span class="level-end"><span class="level-item tag">2</span></span></a></li></ul></div></div></div><div class="card widget"><div class="card-content"><div class="menu"><h3 class="menu-label">Etiquetas</h3><div class="field is-grouped is-grouped-multiline"><div class="control"><a class="tags has-addons" href="/tags/DSL/"><span class="tag">DSL</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/GPU/"><span class="tag">GPU</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/Huge-Page/"><span class="tag">Huge Page</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/Pin/"><span class="tag">Pin</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/Python/"><span class="tag">Python</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/SystemTap/"><span class="tag">SystemTap</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/algorithms/"><span class="tag">algorithms</span><span class="tag is-grey-lightest">3</span></a></div><div class="control"><a class="tags has-addons" href="/tags/data-structure/"><span class="tag">data structure</span><span class="tag is-grey-lightest">3</span></a></div><div class="control"><a class="tags has-addons" href="/tags/image-processing/"><span class="tag">image processing</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/javascript/"><span class="tag">javascript</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/pip/"><span class="tag">pip</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/pypi/"><span class="tag">pypi</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/python/"><span class="tag">python</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%86%B3%E7%AD%96%E8%AE%BA/"><span class="tag">决策论</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%8D%9A%E5%BC%88%E8%AE%BA/"><span class="tag">博弈论</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%9B%BE/"><span class="tag">图</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%9B%BE%E5%83%8F%E5%A4%84%E7%90%86/"><span class="tag">图像处理</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E5%B0%8F%E4%B8%96%E7%95%8C%E9%97%AE%E9%A2%98/"><span class="tag">小世界问题</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E6%9C%89%E5%90%91%E5%9B%BE/"><span class="tag">有向图</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E6%B5%81%E8%A1%8C%E6%AD%8C%E6%9B%B2/"><span class="tag">流行歌曲</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E6%BC%94%E5%94%B1/"><span class="tag">演唱</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%A4%BE%E4%BC%9A%E8%AE%A1%E7%AE%97/"><span class="tag">社会计算</span><span class="tag is-grey-lightest">6</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%AE%97%E6%B3%95/"><span class="tag">算法</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%AE%97%E6%B3%95%E4%B8%8E%E6%95%B0%E6%8D%AE%E7%BB%93%E6%9E%84/"><span class="tag">算法与数据结构</span><span class="tag is-grey-lightest">3</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%BC%96%E7%A8%8B%E8%8C%83%E5%BC%8F/"><span class="tag">编程范式</span><span class="tag is-grey-lightest">2</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E7%BD%91%E9%A1%B5%E6%8E%92%E5%BA%8F/"><span class="tag">网页排序</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E8%AE%A1%E7%AE%97%E6%80%9D%E7%BB%B4/"><span class="tag">计算思维</span><span class="tag is-grey-lightest">1</span></a></div><div class="control"><a class="tags has-addons" href="/tags/%E8%BF%90%E7%AD%B9%E5%AD%A6/"><span class="tag">运筹学</span><span class="tag is-grey-lightest">1</span></a></div></div></div></div></div><div class="card widget"><div class="card-content"><div class="menu"><h3 class="menu-label">Subscribe to Updates</h3><form action="https://feedburner.google.com/fb/a/mailverify" method="post" target="popupwindow" onsubmit="window.open(&#039;https://feedburner.google.com/fb/a/mailverify?uri=15ovpvd8su4sb5j9um1lhtb2j4&#039;,&#039;popupwindow&#039;,&#039;scrollbars=yes,width=550,height=520&#039;);return true"><input type="hidden" value="15ovpvd8su4sb5j9um1lhtb2j4" name="uri"><input type="hidden" name="loc" value="en_US"><div class="field has-addons"><div class="control has-icons-left is-expanded"><input class="input" name="email" type="email" placeholder="Email"><span class="icon is-small is-left"><i class="fas fa-envelope"></i></span></div><div class="control"><input class="button is-primary" type="submit" value="Subscribe"></div></div></form></div></div></div></div><!--!--></div></div></section><footer class="footer"><div class="container"><div class="level"><div class="level-start"><a class="footer-logo is-block mb-2" href="/"><img src="/img/favicon.png" alt="Hoooo的研究" height="28"></a><p class="size-small"><span>&copy; 2020 Jianan Hu</span>  Powered by <a href="https://hexo.io/" target="_blank" rel="noopener">Hexo</a> &amp; <a href="https://github.com/ppoffice/hexo-theme-icarus" target="_blank" rel="noopener">Icarus</a></p></div><div class="level-end"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/jquery@3.3.1/dist/jquery.min.js"></script><script src="https://cdn.jsdelivr.net/npm/moment@2.22.2/min/moment-with-locales.min.js"></script><script>moment.locale("zh-cmn-Hans");</script><script>var IcarusThemeSettings = {
            site: {
                url: 'http://www.hoooo.org',
                external_link: {"enable":true,"exclude":[]}
            },
            article: {
                highlight: {
                    clipboard: true,
                    fold: 'unfolded'
                }
            }
        };</script><script src="https://cdn.jsdelivr.net/npm/clipboard@2.0.4/dist/clipboard.min.js" defer></script><a id="back-to-top" title="Zurück nach oben" href="javascript:;"><i class="fas fa-chevron-up"></i></a><script src="/js/back_to_top.js" defer></script><!--!--><script src="https://cdn.jsdelivr.net/npm/lightgallery@1.6.8/dist/js/lightgallery.min.js" defer></script><script src="https://cdn.jsdelivr.net/npm/justifiedGallery@3.7.0/dist/js/jquery.justifiedGallery.min.js" defer></script><script>window.addEventListener("load", () => {
            if (typeof $.fn.lightGallery === 'function') {
                $('.article').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof $.fn.justifiedGallery === 'function') {
                if ($('.justified-gallery > p > .gallery-item').length) {
                    $('.justified-gallery > p > .gallery-item').unwrap();
                }
                $('.justified-gallery').justifiedGallery();
            }
        });</script><!--!--><!--!--><script src="/js/main.js" defer></script><div class="searchbox"><div class="searchbox-container"><div class="searchbox-header"><div class="searchbox-input-container"><input class="searchbox-input" type="text" placeholder="Teclea algo..."></div><a class="searchbox-close" href="javascript:;">×</a></div><div class="searchbox-body"></div></div></div><script src="/js/insight.js" defer></script><script>document.addEventListener('DOMContentLoaded', function () {
            loadInsight({"contentUrl":"/content.json"}, {"hint":"Teclea algo...","untitled":"(Untitled)","posts":"Entradas","pages":"Pages","categories":"Categorías","tags":"Etiquetas"});
        });</script></body></html>